Repository: bitfoundation/bitplatform
Catalog: src/Templates/Boilerplate/Bit.Boilerplate/src/Shared/Resources/AppStrings.*.resx
Languages: ar, de, es, fa, fr, hi, nl, sv

# CompareAttribute_ValidationError
source: '{0}' and '{1}' do not match.
ar: '{0}' و '{1}' لا يتطابقان.
de: '{0}' und '{1}' stimmen nicht überein.
es: '{0}' y '{1}' no coinciden.
fa: "{0}" و "{1}" مطابقت ندارند.
fr: '{0}' et '{1}' ne correspondent pas.
hi: ' {0} ' और ' {1} ' मेल नहीं खाते।
nl: '{0}' en '{1}' komen niet overeen.
sv: '{0}' och '{1}' stämmer inte överens.

# EmailAddressAttribute_ValidationError
source: The {0} field is not a valid e-mail address.
ar: حقل {0} ليس عنوان بريد إلكتروني صالحًا.
de: Das Feld {0} ist keine gültige E-Mail-Adresse.
es: El campo {0} no es una dirección de correo electrónico válida.
fa: مقدار {0} یک آدرس ایمیل معتبر نیست.
fr: Le champ {0} n'est pas une adresse e-mail valide.
hi: {0} फ़ील्ड एक वैध ई-मेल पता नहीं है।
nl: Het veld {0} is geen geldig e-mailadres.
sv: Fältet {0} är inte en giltig e-postadress.

# MaxLengthAttribute_InvalidMaxLength
source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
ar: يجب أن يكون لـ MaxLengthAttribute قيمة طول أكبر من صفر. استخدم MaxLength() بدون معاملات للإشارة إلى أن السلسلة أو المصفوفة يمكن أن يكون لها الطول الأقصى المسموح به.
de: MaxLengthAttribute muss einen Längenwert haben, der größer als Null ist. Verwenden Sie MaxLength() ohne Parameter, um anzugeben, dass der String oder das Array die maximale zulässige Länge haben kann.
es: MaxLengthAttribute debe tener un valor Length mayor que cero. Use MaxLength() sin parámetros para indicar que la cadena o el arreglo puede tener la longitud máxima permitida.
fr: MaxLengthAttribute doit avoir une valeur Length supérieure à zéro. Utilisez MaxLength() sans paramètres pour indiquer que la chaîne ou le tableau peut avoir la longueur maximale autorisée.
hi: MaxLengthAttribute को शून्य से अधिक लंबाई मान होना चाहिए। अधिकतम अनुमत लंबाई का संकेत देने के लिए बिना पैरामीटर के MaxLength() का उपयोग करें, ताकि स्ट्रिंग या ऐरे अधिकतम अनुमत लंबाई हो सके।
nl: MaxLengthAttribute moet een lengtewaarde hebben die groter is dan nul. Gebruik MaxLength() zonder parameters om aan te geven dat de tekenreeks of het array de maximale toegestane lengte kan hebben.
sv: MaxLengthAttribute måste ha ett Length-värde som är större än noll. Använd MaxLength() utan parametrar för att ange att strängen eller arrayen kan ha den maximalt tillåtna längden.

# MinLengthAttribute_ValidationError
source: The field {0} must be a string or array type with a minimum length of '{1}'.
ar: يجب أن يكون حقل {0} من نوع سلسلة أو مصفوفة بطول أدنى '{1}'.
de: Das Feld {0} muss ein String- oder Array-Typ mit einer Mindestlänge von '{1}' sein.
es: El campo {0} debe ser un tipo cadena o arreglo con una longitud mínima de '{1}'.
fa: مقدار {0} باید یک نوع رشته یا لیستی با حداقل طول "{1}" باشد.
fr: Le champ {0} doit être de type chaîne ou tableau avec une longueur minimale de '{1}'.
hi: {0} फ़ील्ड '{1}' की न्यूनतम लंबाई वाला स्ट्रिंग या ऐरे प्रकार का होना चाहिए।
nl: Het veld {0} moet een tekenreeks- of arraytype zijn met een minimale lengte van '{1}'.
sv: Fältet {0} måste vara en sträng- eller arraytyp med en minsta längd på '{1}'.

# RangeAttribute_ValidationError
source: The field {0} must be between {1} and {2}.
ar: يجب أن يكون حقل {0} بين {1} و {2}.
de: Das Feld {0} muss zwischen {1} und {2} liegen.
es: El campo {0} debe estar entre {1} y {2}.
fa: مقدار {0} باید بین {1} و {2} باشد.
fr: Le champ {0} doit être compris entre {1} et {2}.
hi: {0} फ़ील्ड {1} और {2} के बीच होना चाहिए।
nl: Het veld {0} moet tussen {1} en {2} liggen.
sv: Fältet {0} måste vara mellan {1} och {2}.

# RequiredAttribute_ValidationError
source: The {0} field is required.
ar: حقل {0} مطلوب.
de: Das Feld {0} ist erforderlich.
es: El campo {0} es requerido.
fa: مقدار {0} الزامی است.
fr: Le champ {0} est requis.
hi: {0} फ़ील्ड आवश्यक है।
nl: Het veld {0} is verplicht.
sv: Fältet {0} krävs.

# PhoneAttribute_ValidationError
source: The {0} field is not a valid phone number.
ar: حقل {0} ليس رقم هاتف صالحًا.
de: Das Feld {0} ist keine gültige Telefonnummer.
es: El campo {0} no es un número de teléfono válido.
fa: مقدار {0} یک شماره تلفن معتبر نیست.
fr: Le champ {0} n'est pas un numéro de téléphone valide.
hi: {0} फ़ील्ड एक वैध फोन नंबर नहीं है।
nl: Het veld {0} is geen geldig telefoonnummer.
sv: Fältet {0} är inte ett giltigt telefonnummer.

# BadRequestException
source: Invalid request
ar: طلب غير صالح
de: Ungültige Anfrage
es: Solicitud inválida
fa: درخواست نامعتبر
fr: Requête invalide
hi: अमान्य अनुरोध
nl: Ongeldig verzoek
sv: Ogiltig förfrågan

# ConflictException
source: Request could not be processed because of conflict in the request
ar: تعذر معالجة الطلب بسبب تضارب في الطلب
de: Anfrage konnte aufgrund eines Konflikts in der Anfrage nicht verarbeitet werden
es: La solicitud no pudo procesarse debido a un conflicto en la solicitud
fa: درخواست به دلیل مغایرت داشتن پردازش نشد
fr: La requête n'a pas pu être traitée en raison d'un conflit dans la requête
hi: अनुरोध में संघर्ष के कारण अनुरोध प्रोसेस नहीं किया जा सका
nl: Het verzoek kon niet worden verwerkt vanwege een conflict in het verzoek
sv: Begäran kunde inte behandlas på grund av en konflikt

# ForbiddenException
source: Access to the requested resource is forbidden
ar: الوصول إلى المورد المطلوب محظور
de: Zugriff auf die angeforderte Ressource ist verboten
es: El acceso al recurso solicitado está prohibido
fa: دسترسی به منابع درخواست شده ممنوع است
fr: L'accès à la ressource demandée est interdit
hi: अनुरोधित संसाधन तक पहुंच निषिद्ध है
nl: Toegang tot de gevraagde bron is verboden
sv: Åtkomst till den begärda resursen är förbjuden

# ResourceValidationException
source: Request data is not valid
ar: بيانات الطلب غير صالحة
de: Anfragedaten sind nicht gültig
es: Los datos de la solicitud no son válidos
fa: داده‌های درخواست معتبر نیستند
fr: Les données de la requête ne sont pas valides
hi: अनुरोध डेटा वैध नहीं है
nl: Gegevens van het verzoek zijn niet geldig
sv: Ogiltig data i begäran

# RestException
source: An error occurred while communicating with server
ar: حدث خطأ أثناء التواصل مع الخادم
de: Ein Fehler ist aufgetreten, während mit dem Server kommuniziert wurde
es: Ocurrió un error al comunicarse con el servidor
fa: هنگام برقراری ارتباط با سرور خطایی رخ داد
fr: Une erreur s'est produite lors de la communication avec le serveur
hi: सर्वर के साथ संचार करते समय एक त्रुटि हुई
nl: Er is een fout opgetreden tijdens de communicatie met de server
sv: Ett fel uppstod vid kommunikation med servern

# UnauthorizedException
source: Your request lacks valid authentication credentials
ar: طلبك يفتقر إلى بيانات اعتماد مصادقة صالحة
de: Ihre Anfrage enthält keine gültigen Authentifizierungsdaten
es: Su solicitud carece de credenciales de autenticación válidas
fa: درخواست شما فاقد اعتبارنامه معتبر احراز هویت است
fr: Votre requête manque de credentials d'authentification valides
hi: आपके अनुरोध में वैध प्रमाणीकरण क्रेडेंशियल्स की कमी है
nl: Uw verzoek mist geldige authenticatiegegevens
sv: Din förfrågan saknar giltiga autentiseringsuppgifter

# UnknownException
source: Unknown error has occurred
ar: حدث خطأ غير معروف
de: Unbekannter Fehler ist aufgetreten
es: Ha ocurrido un error desconocido
fa: خطای ناشناخته رخ داده است
fr: Une erreur inconnue s'est produite
hi: अज्ञात त्रुटि हुई है
nl: Onbekende fout is opgetreden
sv: Ett okänt fel har uppstått

# UpdateConcurrencyException
source: The record was modified by another user after you got the original data. the operation was canceled.
ar: تم تعديل السجل بواسطة مستخدم آخر بعد الحصول على البيانات الأصلية. تم إلغاء العملية.
de: Der Datensatz wurde von einem anderen Benutzer nach dem Abruf der Originaldaten geändert. Der Vorgang wurde abgebrochen.
es: El registro fue modificado por otro usuario después de que obtuvo los datos originales. La operación fue cancelada.
fa: رکورد توسط یک کاربر دیگر پس از دریافت داده های اصلی تغییر یافته است. عملیات لغو شد.
fr: L'enregistrement a été modifié par un autre utilisateur après que vous ayez obtenu les données originales. L'opération a été annulée.
hi: रिकॉर्ड को मूल डेटा प्राप्त करने के बाद किसी अन्य उपयोगकर्ता द्वारा संशोधित किया गया था। ऑपरेशन रद्द कर दिया गया।
nl: Het record is gewijzigd door een andere gebruiker nadat u de oorspronkelijke gegevens hebt ontvangen. De bewerking is geannuleerd.
sv: Posten ändrades av en annan användare efter att du hämtade den ursprungliga informationen. Åtgärden avbröts.

# ResourceNotFoundException
source: Resource not found
ar: المورد غير موجود
de: Ressource nicht gefunden
es: Recurso no encontrado
fa: منبع یافت نشد
fr: Ressource non trouvée
hi: संसाधन नहीं मिला
nl: Bron niet gevonden
sv: Resursen hittades inte

# ServerConnectionException
source: Unable to connect to server.
ar: تعذر الاتصال بالخادم.
de: Verbindung zum Server nicht möglich.
es: No se puede conectar al servidor.
fa: قادر به اتصال به سرور نیست.
fr: Impossible de se connecter au serveur.
hi: सर्वर से कनेक्ट करने में असमर्थ।
nl: Kan geen verbinding maken met de server.
sv: Kan inte ansluta till servern.

source: Active
ar: نشط
de: Aktiv
es: Activo
fa: فعال
fr: Actif
hi: सक्रिय
nl: Actief
sv: Aktiv

source: All
ar: الكل
de: Alle
es: Todos
fa: همه
fr: Tous
hi: सभी
nl: Alle
sv: Alla

# Alphabetical
source: A-Z
ar: من أ إلى ي
fa: ا-ی
sv: A-Ö

source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fa: تمام شده
fr: Terminé
hi: पूरा
nl: Voltooid
sv: Slutförd

source: Date
ar: التاريخ
de: Datum
es: Fecha
fa: تاریخ
hi: तारीख
nl: Datum
sv: Datum

# SettingsPageTitle
source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fa: تنظیمات
fr: Paramètres
hi: सेटिंग्स
nl: Instellingen
sv: Inställningar

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fa: تنظیمات
fr: Paramètres
hi: सेटिंग्स
nl: Instellingen
sv: Inställningar

source: Dark
ar: داكن
de: Dunkel
es: Oscuro
fa: تیره
fr: Sombre
hi: डार्क
nl: Donker
sv: Mörk

source: Light
ar: فاتح
de: Hell
es: Claro
fa: روشن
fr: Clair
hi: लाइट
nl: Licht
sv: Ljus

source: Language
ar: اللغة
de: Sprache
es: Idioma
fa: زبان
fr: Langue
hi: भाषा
nl: Taal
sv: Språk

source: Select language
ar: اختر اللغة
de: Sprache auswählen
es: Seleccionar idioma
fa: انتخاب زبان
fr: Sélectionner la langue
hi: भाषा चुनें
nl: Selecteer taal
sv: Välj språk

# ProfileTitle
source: Profile
ar: الملف الشخصي
de: Profil
es: Perfil
fa: پروفایل
fr: Profil
hi: प्रोफ़ाइल
nl: Profiel
sv: Profil

# ProfileSubtitle
source: Edit your profile data
ar: عدّل بيانات ملفك الشخصي
de: Bearbeiten Sie Ihre Profildaten
es: Editar los datos de tu perfil
fa: داده های پروفایل خود را تغییر دهید
fr: Modifier vos données de profil
hi: अपनी प्रोफ़ाइल डेटा संपादित करें
nl: Bewerk uw profielgegevens
sv: Redigera din profildata

# SuccessfulSendChangeEmailTokenMessage
source: Change email token has been sent to you
ar: تم إرسال رمز تغيير البريد الإلكتروني إليك
de: Token zur Änderung der E-Mail wurde an Sie gesendet
es: El token para cambiar el correo electrónico ha sido enviado
fa: توکن تغییر ایمیل برای شما ارسال شد
fr: Un jeton de changement d'e-mail vous a été envoyé
hi: ईमेल बदलने का टोकन आपको भेज दिया गया है
nl: Er is een e-mailtoken voor wijziging naar u verzonden
sv: Koden för att byta e-post har skickats till dig

# SuccessfulSendChangePhoneNumberTokenMessage
source: Change phone number token has been sent to you
ar: تم إرسال رمز تغيير رقم الهاتف إليك
de: Token zur Änderung der Telefonnummer wurde an Sie gesendet
es: El token para cambiar el número de teléfono ha sido enviado
fa: توکن تغییر شماره تلفن برای شما ارسال شد
fr: Un jeton de changement de numéro de téléphone vous a été envoyé
hi: फ़ोन नंबर बदलने का टोकन आपको भेज दिया गया है
nl: Er is een tokencode voor telefoonnummerwijziging naar u verzonden
sv: Koden för att byta telefonnummer har skickats till dig

# SuccessfulSendTokenMessage
source: The token has been sent to you
ar: تم إرسال الرمز إليك
de: Der Token wurde an Sie gesendet
es: El token ha sido enviado
fa: توکن برای شما ارسال شد
fr: Le jeton vous a été envoyé
hi: टोकन आपको भेज दिया गया है
nl: De token is naar u verzonden
sv: Koden har skickats till dig

# SessionsTitle
source: Sessions
ar: الجلسات
de: Sitzungen
es: Sesiones
fa: نشست‌ها
hi: सत्र
nl: Sessies
sv: Sessioner

# SessionsSubtitle
source: Your active sessions across multiple devices
ar: جلساتك النشطة عبر أجهزة متعددة
de: Ihre aktiven Sitzungen auf mehreren Geräten
es: Tus sesiones activas en múltiples dispositivos
fa: نشست‌های فعال شما در دستگاههای مختلف
fr: Vos sessions actives sur plusieurs appareils
hi: एकाधिक उपकरणों पर आपके सक्रिय सत्र
nl: Uw actieve sessies op meerdere apparaten
sv: Dina aktiva sessioner på flera enheter

source: Current session
ar: الجلسة الحالية
de: Aktuelle Sitzung
es: Sesión actual
fa: نشست جاری
fr: Session actuelle
hi: वर्तमान सत्र
nl: Huidige sessie
sv: Nuvarande session

source: Other sessions
ar: جلسات أخرى
de: Andere Sitzungen
es: Otras sesiones
fa: سایر نشست‌ها
fr: Autres sessions
hi: अन्य सत्र
nl: Andere sessies
sv: Andra sessioner

source: Try removing other sessions
ar: جرب إزالة جلسات أخرى
de: Versuchen Sie, andere Sitzungen zu entfernen
es: Intenta eliminar otras sesiones
fa: حذف سایر نشست‌ها
fr: Essayez de supprimer d'autres sessions
hi: अन्य सत्र हटाने का प्रयास करें
nl: Probeer andere sessies te verwijderen
sv: Försök ta bort andra sessioner

# RemoveSessionSuccessMessage
source: Session removed successfully
ar: تم إزالة الجلسة بنجاح
de: Sitzung erfolgreich entfernt
es: Sesión eliminada exitosamente
fa: حذف نشست با موفقیت انجام شد
fr: Session supprimée avec succès
hi: सत्र सफलतापूर्वक हटा दिया गया
nl: Sessie succesvol verwijderd
sv: Sessionen har tagits bort.

# NotFoundText
source: There is nothing here.
ar: لا يوجد شيء هنا.
de: Hier ist nichts.
es: No hay nada aquí.
fa: چیزی پیدا نشد.
fr: Il n'y a rien ici.
hi: यहाँ कुछ नहीं है।
nl: Er is hier niets.
sv: Det finns inget här.

# UpdateWebViewThroughGooglePlay
source: Please update webview through google play.
ar: يرجى تحديث webview عبر google play.
de: Bitte aktualisieren Sie die Webansicht über den Google Play Store.
es: Por favor actualiza webview a través de Google Play.
fa: لطفا وب ویو را از طریق Google Play آپدیت کنید
fr: Veuillez mettre à jour le webview via Google Play.
hi: कृपया Google Play के माध्यम से वेबव्यू अपडेट करें।
nl: Update de webview via Google Play.
sv: Uppdatera webview via Google Play.

source: Ok
ar: موافق
es: Aceptar
fa: باشه
hi: ठीक है
nl: Oké

source: Full name
ar: الاسم الكامل
de: Vollständiger Name
es: Nombre completo
fa: نام کامل
fr: Nom complet
hi: पूरा नाम
nl: Volledige naam
sv: Fullt namn

# TermsPageTitle
source: Terms
ar: الشروط
de: Nutzungsbedingungen
es: Términos
fa: شرایط
fr: Conditions
hi: शर्तें
nl: Voorwaarden
sv: Villkor

source: Terms
ar: الشروط
de: Nutzungsbedingungen
es: Términos
fa: شرایط
fr: Conditions
hi: शर्तें
nl: Voorwaarden
sv: Villkor

# ProfileUpdatedSuccessfullyMessage
source: Profile updated successfully.
ar: تم تحديث الملف الشخصي بنجاح.
de: Profil erfolgreich aktualisiert.
es: Perfil actualizado exitosamente.
fa: پروفایل با موفقیت به روز شد.
fr: Profil mis à jour avec succès.
hi: प्रोफ़ाइल सफलतापूर्वक अपडेट हो गई।
nl: Profiel succesvol bijgewerkt.
sv: Profilen har uppdaterats.

source: Confirm Password
ar: تأكيد كلمة المرور
de: Passwort bestätigen
es: Confirmar contraseña
fa: تایید رمز عبور
fr: Confirmer le mot de passe
hi: पासवर्ड की पुष्टि करें
nl: Bevestig wachtwoord
sv: Bekräfta lösenord

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة
de: Neues Passwort bestätigen
es: Confirmar nueva contraseña
fa: تایید رمز عبور جدید
fr: Confirmer le nouveau mot de passe
hi: नए पासवर्ड की पुष्टि करें
nl: Bevestig nieuw wachtwoord
sv: Bekräfta nytt lösenord

source: Email
ar: البريد الإلكتروني
es: Correo electrónico
fa: ایمیل
hi: ईमेल
sv: E-post

source: New email
ar: بريد إلكتروني جديد
de: Neue E-Mail
es: Nuevo correo electrónico
fa: ایمیل جدید
fr: Nouvel e-mail
hi: नया ईमेल
nl: Nieuwe e-mail
sv: Ny e-post

# NewEmailPlaceholder
source: Enter new email
ar: أدخل البريد الإلكتروني الجديد
de: Neue E-Mail eingeben
es: Ingresar nuevo correo electrónico
fa: ایمیل جدید را وارد کنید
fr: Saisir un nouvel e-mail
hi: नया ईमेल दर्ज करें
nl: Voer nieuwe e-mail in
sv: Ange ny e-post

source: Phone
ar: الهاتف
de: Telefon
es: Teléfono
fa: تلفن
fr: Téléphone
hi: फ़ोन
nl: Telefoon
sv: Telefon

source: Phone Number
ar: رقم الهاتف
de: Telefonnummer
es: Número de teléfono
fa: شماره تلفن
fr: Numéro de téléphone
hi: फ़ोन नंबर
nl: Telefoonnummer
sv: Telefonnummer

source: New phone number
ar: رقم هاتف جديد
de: Neue Telefonnummer
es: Nuevo número de teléfono
fa: شماره تلفن جدید
fr: Nouveau numéro de téléphone
hi: नया फ़ोन नंबर
nl: Nieuw telefoonnummer
sv: Nytt telefonnummer

# NewPhoneNumberPlaceholder
source: Enter new phone number
ar: أدخل رقم الهاتف الجديد
de: Neue Telefonnummer eingeben
es: Ingresar nuevo número de teléfono
fa: شماره تلفن جدید را وارد کنید
fr: Saisir un nouveau numéro de téléphone
hi: नया फ़ोन नंबर दर्ज करें
nl: Voer nieuw telefoonnummer in
sv: Ange nytt telefonnummer

# GoBack
source: Back
ar: رجوع
de: Zurück
es: Atrás
fa: بازگشت
fr: Retour
hi: पीछे
nl: Terug
sv: Tillbaka

source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fa: رمز عبور
fr: Mot de passe
hi: पासवर्ड
nl: Wachtwoord
sv: Lösenord

# PasswordPlaceholder
source: Enter password
ar: أدخل كلمة المرور
de: Passwort eingeben
es: Ingresar contraseña
fa: پسورد را وارد کنید
fr: Saisir le mot de passe
hi: पासवर्ड दर्ज करें
nl: Voer wachtwoord in
sv: Ange lösenord

source: Error
ar: خطأ
de: Fehler
fa: خطا
fr: Erreur
hi: त्रुटि
nl: Fout
sv: Fel

source: Gender
ar: الجنس
de: Geschlecht
es: Género
fa: جنسیت
fr: Genre
hi: लिंग
nl: Geslacht
sv: Kön

source: Birthdate
ar: تاريخ الميلاد
de: Geburtsdatum
es: Fecha de nacimiento
fa: تاریخ تولد
fr: Date de naissance
hi: जन्मतिथि
nl: Geboortedatum
sv: Födelsedatum

source: Username
ar: اسم المستخدم
de: Benutzername
es: Nombre de usuario
fa: نام کاربری
fr: Nom d'utilisateur
hi: उपयोगकर्ता नाम
nl: Gebruikersnaam
sv: Användarnamn

source: Name
ar: الاسم
es: Nombre
fa: نام
fr: Nom
hi: नाम
nl: Naam
sv: Namn

source: Description
ar: الوصف
de: Beschreibung
es: Descripción
fa: توضیحات
hi: विवरण
nl: Beschrijving
sv: Beskrivning

source: Price
ar: السعر
de: Preis
es: Precio
fa: قيمت
fr: Prix
hi: मूल्य
nl: Prijs
sv: Pris

source: Either provide email or phone number.
ar: يجب تقديم بريد إلكتروني أو رقم هاتف.
de: Geben Sie entweder eine E-Mail oder Telefonnummer an.
es: Proporciona correo electrónico o número de teléfono.
fa: یا ایمیل یا شماره تلفن را وارد کنید.
fr: Fournir soit un e-mail, soit un numéro de téléphone.
hi: ईमेल या फ़ोन नंबर प्रदान करें।
nl: Geef óf e-mail óf telefoonnummer op.
sv: Ange antingen e-post eller telefonnummer.

# EitherProvideUserNameOrEmailOrPhoneNumber
source: Either provide username, email or phone number.
ar: يجب تقديم اسم مستخدم أو بريد إلكتروني أو رقم هاتف.
de: Geben Sie Benutzername, E-Mail oder Telefonnummer an.
es: Proporciona nombre de usuario, correo electrónico o número de teléfono.
fa: یا ایمیل یا شماره تلفن یا نام کاربری را وارد کنید.
fr: Fournir soit un nom d'utilisateur, un e-mail ou un numéro de téléphone.
hi: उपयोगकर्ता नाम, ईमेल या फ़ोन नंबर प्रदान करें।
nl: Geef óf gebruikersnaam, óf e-mail óf telefoonnummer op.
sv: Ange antingen användarnamn, e-post eller telefonnummer.

# YouNeedToSignIn
source: You must be signed in to continue.
ar: يجب أن تكون مسجل الدخول للمتابعة.
de: Sie müssen angemeldet sein, um fortzufahren.
es: Debes iniciar sesión para continuar.
fa: برای ادامه باید وارد شوید.
fr: Vous devez être connecté pour continuer.
hi: जारी रखने के लिए आपको साइन इन होना चाहिए।
nl: U moet zijn aangemeld om door te gaan.
sv: Du måste vara inloggad för att fortsätta.

source: Invalid user credentials
ar: بيانات اعتماد المستخدم غير صالحة
de: Ungültige Benutzerdaten
es: Credenciales de usuario inválidas
fa: اطلاعات کاربری نادرست است
fr: Identifiants utilisateur invalides
hi: अमान्य उपयोगकर्ता क्रेडेंशियल्स
nl: Ongeldige gebruikersreferenties
sv: Ogiltiga användaruppgifter

# EmailAlreadyConfirmed
source: Your email is already confirmed.
ar: بريدك الإلكتروني مؤكد بالفعل.
de: Ihre E-Mail ist bereits bestätigt.
es: Tu correo electrónico ya está confirmado.
fa: ایمیل شما قبلا تایید شده است.
fr: Votre e-mail est déjà confirmé.
hi: आपका ईमेल पहले ही पुष्टि हो चुका है।
nl: Uw e-mail is al bevestigd.
sv: Din e-post är redan bekräftad.

# PhoneNumberAlreadyConfirmed
source: Your phone number is already confirmed.
ar: رقم هاتفك مؤكد بالفعل.
de: Ihre Telefonnummer ist bereits bestätigt.
es: Tu número de teléfono ya está confirmado.
fa: شماره تلفن شما قبلا تایید شده است
fr: Votre numéro de téléphone est déjà confirmé.
hi: आपका फ़ोन नंबर पहले ही पुष्टि हो चुका है।
nl: Uw telefoonnummer is al bevestigd.
sv: Ditt telefonnummer är redan bekräftat.

source: Title
ar: العنوان
de: Titel
es: Título
fa: عنوان
fr: Titre
hi: शीर्षक
nl: Titel
sv: Titel

# AreYouSureWannaDelete
source: Are you sure you want to delete {0}?
ar: هل أنت متأكد من رغبتك في حذف {0}؟
de: Sind Sie sicher, dass Sie {0} löschen möchten?
es: ¿Estás seguro de que deseas eliminar {0}?
fa: آیا مطمئن هستید که می خواهید {0} را حذف کنید؟
fr: Êtes-vous sûr de vouloir supprimer {0} ?
hi: क्या आप वाकई {0} को हटाना चाहते हैं?
nl: Weet u zeker dat u {0} wilt verwijderen?
sv: Är du säker på att du vill ta bort {0}?

source: Home
ar: الرئيسية
de: Startseite
es: Inicio
fa: خانه
fr: Accueil
hi: होम
sv: Hem

source: Refresh
ar: تحديث
de: Aktualisieren
es: Actualizar
fa: تلاش مجدد
fr: Actualiser
hi: रिफ्रेश
nl: Vernieuwen
sv: Uppdatera

source: Recover
ar: استعادة
de: Wiederherstellen
es: Recuperar
fa: بازیابی
fr: Récupérer
hi: पुनर्प्राप्त करें
nl: Herstellen
sv: Återställ

# SomethingWentWrong
source: Oops, something went wrong...
ar: عفوًا، حدث خطأ ما...
de: Ups, etwas ist schiefgelaufen...
es: ¡Ups, algo salió mal...
fa: اوه! به نظر مشکلی پیش اومده...
fr: Oups, quelque chose s'est mal passé...
hi: ओह, कुछ गलत हो गया...
nl: Oeps, er is iets misgegaan...
sv: Oj, något gick fel...

source: Back to home
ar: العودة إلى الرئيسية
de: Zurück zur Startseite
es: Volver al inicio
fa: بازگشت به خانه
fr: Retour à l'accueil
hi: होम पर वापस
nl: Terug naar home
sv: Tillbaka till hem

# UserLockedOut
source: User is locked out. Try again in {0}
ar: المستخدم محظور. جرب مرة أخرى بعد {0}
de: Benutzer ist gesperrt. Versuchen Sie es in {0} erneut
es: El usuario está bloqueado. Intenta de nuevo en {0}
fa: کاربر قفل شده است. دوباره امتحان کنید در {0}
fr: Utilisateur verrouillé. Réessayez dans {0}
hi: उपयोगकर्ता लॉक आउट है। {0} में पुनः प्रयास करें
nl: Gebruiker is geblokkeerd. Probeer het opnieuw over {0}
sv: Användaren är utestängd. Försök igen om {0}

source: User is not confirmed.
ar: المستخدم غير مؤكد.
de: Benutzer ist nicht bestätigt.
es: El usuario no está confirmado.
fa: حساب خود را تایید نکرده اید
fr: Utilisateur non confirmé.
hi: उपयोगकर्ता पुष्टि नहीं हुआ है।
nl: Gebruiker is niet bevestigd.
sv: Användaren är inte bekräftad.

# UserNotFound
source: User does not exist.
ar: المستخدم غير موجود.
de: Benutzer existiert nicht.
es: El usuario no existe.
fa: کاربر وجود ندارد.
fr: Utilisateur n'existe pas.
hi: उपयोगकर्ता मौजूद नहीं है।
nl: Gebruiker bestaat niet.
sv: Användaren finns inte.

# DuplicateEmailOrPhoneNumber
source: This email or phone number is already taken.
ar: هذا البريد الإلكتروني أو رقم الهاتف مستخدم بالفعل.
de: Diese E-Mail oder Telefonnummer ist bereits vergeben.
es: Este correo electrónico o número de teléfono ya está en uso.
fa: این ایمیل یا شماره تلفن قبلا گرفته شده است.
fr: Cet e-mail ou numéro de téléphone est déjà pris.
hi: यह ईमेल या फ़ोन नंबर पहले से लिया गया है।
nl: Dit e-mailadres of telefoonnummer is al in gebruik.
sv: Denna e-post eller detta telefonnummer är redan upptaget.

source: Add
ar: إضافة
de: Hinzufügen
es: Agregar
fa: اضافه کردن
fr: Ajouter
hi: जोड़ें
nl: Toevoegen
sv: Lägg till
