Repository: bitfoundation/bitplatform
Catalog: src/Templates/Boilerplate/Bit.Boilerplate/src/Shared/Resources/AppStrings.*.resx
Languages: ar, de, es, fa, fr, hi, nl, sv

# SignOutPrompt
source: Are you sure you want to Sign out?
ar: هل أنت متأكد من رغبتك في تسجيل الخروج؟
de: Sind Sie sicher, dass Sie sich abmelden möchten?
es: ¿Estás seguro de que deseas cerrar sesión?
fa: آیا مطمئن هستید که می خواهید خارج شوید؟
fr: Êtes-vous sûr de vouloir vous déconnecter ?
hi: क्या आप वाकई साइन आउट करना चाहते हैं?
nl: Weet u zeker dat u wilt afmelden?
sv: Är du säker på att du vill logga ut?

source: Sign up
ar: إنشاء حساب
de: Registrieren
es: Registrarse
fa: ثبت نام
fr: S'inscrire
hi: साइन अप करें
nl: Registreren
sv: Registrera dig

# SignUpPageTitle
source: Sign up
ar: إنشاء حساب جديد مع
de: Registrieren
es: Registrarse
fa: ثبت نام
fr: S'inscrire
hi: साइन अप करें
nl: Registreren
sv: Registrera dig

# SignUpPanelTitle
source: Get started today
ar: إرسال
de: Heute starten
es: Comienza hoy
fa: امروز آغاز کنید
fr: Commencez aujourd'hui
hi: आज शुरू करें
nl: Begin vandaag
sv: Kom igång idag

# SignUpPanelSubtitle
source: Create new account with
ar: اسحب أو اختر صورة
de: Neues Konto erstellen mit
es: Crear nueva cuenta con
fa: یک اکانت جدید بسازید با
fr: Créer un nouveau compte avec
hi: के साथ नया खाता बनाएं
nl: Maak nieuw account met
sv: Skapa nytt konto med

source: Submit
ar: نعم
de: Absenden
es: Enviar
fa: ارسال
fr: Soumettre
hi: जमा करें
nl: Verzenden
sv: Skicka

source: Yes
ar: الإجراء
de: Ja
es: Sí
fa: بله
fr: Oui
hi: हाँ
nl: Ja
sv: Ja

# SelectBirthDate
source: Select your birth date
ar: رجوع
de: Wählen Sie Ihr Geburtsdatum aus
es: Selecciona tu fecha de nacimiento
fa: تاریخ تولد خود را انتخاب کنید
fr: Sélectionner votre date de naissance
hi: अपनी जन्म तिथि चुनें
nl: Selecteer uw geboortedatum
sv: Välj ditt födelsedatum

source: Action
ar: إلغاء
de: Aktion
es: Acción
fa: عملیات
hi: कार्रवाई
nl: Actie
sv: Åtgärd

source: Back
ar: تحقق من مجلد البريد غير المرغوب فيه/المهمل إذا لم تجده في البريد الوارد.
de: Zurück
es: Atrás
fa: بازگشت
fr: Retour
hi: पीछे
nl: Terug
sv: Tillbaka

source: Cancel
ar: اللون
de: Abbrechen
es: Cancelar
fa: لغو
fr: Annuler
hi: रद्द करें
nl: Annuleren
sv: Avbryt

# CheckSpamMailMessage
source: Check your Spam/Junk, if you could not find it in the Inbox.
ar: لون مخصص
de: Überprüfen Sie Ihren Spam/Junk-Ordner, falls Sie es nicht im Posteingang finden konnten.
es: Revisa tu carpeta de Spam/Basura si no lo encuentras en la Bandeja de entrada.
fa: اگر ایمیل را در Inbox نیافتید، فولدر اسپم / Junk خود را بررسی کنید
fr: Vérifiez vos Spams/Pourriels si vous ne le trouvez pas dans la boîte de réception.
hi: अगर इनबॉक्स में न मिले तो स्पैम/जंक चेक करें।
nl: Controleer uw Spam/Junk als u het niet in de Inbox kunt vinden.
sv: Kontrollera din Spam/Skrot om du inte hittar den i Inkorgen.

source: Color
ar: حذف
de: Farbe
fa: رنگ
fr: Couleur
hi: रंग
nl: Kleur
sv: Färg

source: Custom color
ar: المعرف
de: Benutzerdefinierte Farbe
es: Color personalizado
fa: رنگ سفارشی
fr: Couleur personnalisée
hi: कस्टम रंग
nl: Aangepaste kleur
sv: Anpassad färg

source: Delete
ar: تسجيل الدخول
de: Löschen
es: Eliminar
fa: حذف
fr: Supprimer
hi: हटाएं
nl: Verwijderen
sv: Ta bort

source: Id
ar: تسجيل الدخول (نافذة منبثقة)
fa: شناسه
hi: आईडी

source: Sign in
ar: تأكيد
de: Anmelden
es: Iniciar sesión
fa: ورود به برنامه
fr: Se connecter
hi: साइन इन करें
nl: Aanmelden
sv: Logga in

source: Confirm
ar: أنت مسجل الدخول كـ
de: Bestätigen
es: Confirmar
fa: تایید
fr: Confirmer
hi: पुष्टि करें
nl: Bevestigen
sv: Bekräfta

source: Sign in as different user
ar: نسيت كلمة المرور؟
de: Als anderer Benutzer anmelden
es: Iniciar sesión como usuario diferente
fa: ورود به سیستم به عنوان کاربر متفاوت
fr: Se connecter en tant qu'utilisateur différent
hi: अलग उपयोगकर्ता के रूप में साइन इन करें
nl: Aanmelden als andere gebruiker
sv: Logga in som annan användare

# YouAreSignedInAs
source: You're signed in as
ar: أنثى
de: Sie sind angemeldet als
es: Has iniciado sesión como
fa: شما به سیستم وارد شده اید با
fr: Vous êtes connecté en tant que
hi: आपके रूप में साइन इन हैं
nl: U bent aangemeld als
sv: Du är inloggad som

# ForgotPasswordLink
source: Forgot password?
ar: تذكرني؟
de: Passwort vergessen?
es: ¿Olvidaste tu contraseña?
fa: رمز عبور را فراموش کرده اید؟
fr: Mot de passe oublié ?
hi: पासवर्ड भूल गए?
nl: Wachtwoord vergeten?
sv: Glömt lösenord?

# GenderFemale
source: Female
ar: نسخ
de: Weiblich
es: Femenino
fa: زن
fr: Femme
hi: महिला
nl: Vrouw
sv: Kvinna

source: Remember me?
ar: تم النسخ
de: Eingeloggt bleiben?
es: ¿Recordarme?
fa: من رو به خاطر بسپار؟
fr: Se souvenir de moi ?
hi: मुझे याद रखें?
nl: Onthoud mij?
sv: Kom ihåg mig?

source: Copy
ar: المصادقة الثنائية
de: Kopieren
es: Copiar
fa: کپی
fr: Copier
hi: कॉपी करें
nl: Kopiëren
sv: Kopiera

source: Copied
ar: إدارة المصادقة متعددة العوامل لحسابك
de: Kopiert
es: Copiado
fa: کپی شد
fr: Copié
hi: कॉपी हो गया
nl: Gekopieerd
sv: Kopierad

# TfaTitle
source: Two-factor authentication
ar: كود 2FA
de: Zwei-Faktor-Authentifizierung
es: Autenticación de dos factores
fa: احراز هویت دو عاملی
fr: Authentification à deux facteurs
hi: दो-कारक प्रमाणीकरण
nl: Twee-factor authenticatie
sv: Tvåfaktorsautentisering

# TfaSubtitle
source: Manage your account's multi-factor authentication
ar: كود الاسترداد
de: Verwalten Sie die Multi-Faktor-Authentifizierung Ihres Kontos
es: Administra la autenticación multifactor de tu cuenta
fa: احراز هویت چند عاملی حساب کاربری خود را مدیریت کنید
fr: Gérer l'authentification multi-facteurs de votre compte
hi: अपने खाते का मल्टी-फैक्टर प्रमाणीकरण प्रबंधित करें
nl: Beheer de multi-factor authenticatie van uw account
sv: Hantera ditt kontos multifaktorautentisering

# TwoFactorCode
source: 2FA code
ar: المصادقة الثنائية
es: Código 2FA
fa: کد 2-عاملی
fr: Code 2FA
hi: 2FA कोड
sv: 2FA-kod

# TwoFactorRecoveryCode
source: Recovery code
ar: احصل على كود جديد من تطبيق المصادقة أو استخدم كود الاسترداد.
de: Wiederherstellungscode
es: Código de recuperación
fa: کد بازیابی
fr: Code de récupération
hi: रिकवरी कोड
nl: Herstelcode
sv: Återställningkod

# TfaPanelTitle
source: 2-Factor Authentication
ar: جرب طريقة أخرى
de: Zwei-Faktor-Authentifizierung
es: Autenticación de dos factores
fa: احراز هویت 2-عاملی
fr: Authentification à deux facteurs
hi: 2-फैक्टर प्रमाणीकरण
nl: Twee-factor authenticatie
sv: Tvåfaktorsautentisering

# TfaPanelSubtitle
source: Get a new code from your authenticator app or use your recovery code.
ar: يمكنك الحصول على كود جديد على بريدك الإلكتروني أو هاتفك.
de: Erhalten Sie einen neuen Code aus Ihrer Authentifizierungs-App oder verwenden Sie Ihren Wiederherstellungscode.
es: Obtén un nuevo código de tu app autenticadora o usa tu código de recuperación.
fa: یک کد جدید از برنامه احراز هویت خود دریافت کنید یا از کد بازیابی خود استفاده کنید.
fr: Obtenez un nouveau code depuis votre application d'authentification ou utilisez votre code de récupération.
hi: अपने प्रमाणीकरण ऐप से नया कोड प्राप्त करें या अपनी रिकवरी कोड का उपयोग करें।
nl: Haal een nieuwe code op uit uw authenticator-app of gebruik uw herstelcode.
sv: Hämta en ny kod från din autentiseringsapp eller använd din återställningkod.

# TfaPanelAnotherWayTitle
source: Try another way
ar: الحصول على الكود
de: Anderen Weg versuchen
es: Intenta otra forma
fa: راه دیگری را آزمایش کنید
fr: Essayer une autre méthode
hi: दूसरा तरीका आज़माएं
nl: Probeer een andere manier
sv: Försök ett annat sätt

# TfaPanelAnotherWaySubtitle
source: You can get a new code at your email or phone.
ar: يجب أن تعطل 2FA حتى يتم التحقق من رمز 2FA بناءً على المفتاح المشترك الجديد.
de: Sie können einen neuen Code per E-Mail oder Telefon erhalten.
es: Puedes obtener un nuevo código en tu correo electrónico o teléfono.
fa: شما میتوانید یک کد جدید در ایمیل یا تلفن خود دریافت کنید.
fr: Vous pouvez obtenir un nouveau code à votre e-mail ou téléphone.
hi: आप ईमेल या फ़ोन पर नया कोड प्राप्त कर सकते हैं।
nl: U kunt een nieuwe code krijgen via e-mail of telefoon.
sv: Du kan hämta en ny kod via din e-post eller telefon.

# TfaPanelAnotherWayGetCode
source: Get code
ar: لم يتم تقديم رمز 2FA في الطلب. يلزم رمز 2FA صالح لتمكين 2FA.
de: Code abrufen
es: Obtener código
fr: Obtenir le code
hi: कोड प्राप्त करें
nl: Code ophalen
sv: Hämta kod

# TfaResetSharedKeyError
source: Resetting the 2fa shared key must disable 2fa until a 2fa token based on the new shared key is validated.
ar: رمز 2FA المقدم في الطلب غير صالح. يلزم رمز 2FA صالح لتمكين 2FA.
de: Das Zurücksetzen des 2FA-Freigabeschlüssels deaktiviert 2FA, bis ein 2FA-Token basierend auf dem neuen Freigabes Schlüssel validiert wurde.
es: Restablecer la clave compartida 2FA debe deshabilitar 2FA hasta que se valide un token 2FA basado en la nueva clave compartida.
fa: تنظیم مجدد کلید مشترک 2fa باید 2fa را غیرفعال کند تا زمانی که یک توکن 2fa بر اساس کلید مشترک جدید تأیید شود.
fr: La réinitialisation de la clé partagée 2FA doit désactiver la 2FA jusqu'à ce qu'un jeton 2FA basé sur la nouvelle clé partagée soit validé.
hi: 2fa साझा कुंजी रीसेट करने से 2fa अक्षम हो जाएगा जब तक कि नए साझा कुंजी पर आधारित 2fa टोकन सत्यापित न हो।
nl: Het resetten van de 2FA-gedeelde sleutel schakelt 2FA uit totdat een 2FA-token op basis van de nieuwe gedeelde sleutel is gevalideerd.
sv: Återställning av 2FA-delnyckeln måste inaktivera 2FA tills en 2FA-token baserad på den nya delnyckeln är validerad.

# TfaEmptyCodeError
source: No 2fa token was provided by the request. A valid 2fa token is required to enable 2fa.
ar: إعداد تطبيق المصادقة
de: Kein 2FA-Token wurde von der Anfrage bereitgestellt. Ein gültiger 2FA-Token ist erforderlich, um 2FA zu aktivieren.
es: La solicitud no proporcionó un token 2FA. Se requiere un token 2FA válido para habilitar 2FA.
fa: هیچ کد 2fa توسط درخواست ارائه نشد. یک توکن معتبر 2fa برای فعال کردن 2fa لازم است.
fr: Aucun jeton 2FA n'a été fourni par la requête. Un jeton 2FA valide est requis pour activer la 2FA.
hi: अनुरोध द्वारा कोई 2fa टोकन प्रदान नहीं किया गया। 2fa सक्षम करने के लिए वैध 2fa टोकन आवश्यक है।
nl: Er is geen 2FA-token geleverd door het verzoek. Een geldige 2FA-token is vereist om 2FA in te schakelen.
sv: Ingen 2FA-token tillhandahölls av förfrågan. En giltig 2FA-token krävs för att aktivera 2FA.

# TfaInvalidCodeError
source: The 2fa token provided by the request was invalid. A valid 2fa token is required to enable 2fa.
ar: لاستخدام تطبيق مصادقة، اتبع الخطوات التالية:
de: Der von der Anfrage bereitgestellte 2FA-Token war ungültig. Ein gültiger 2FA-Token ist erforderlich, um 2FA zu aktivieren.
es: El token 2FA proporcionado por la solicitud era inválido. Se requiere un token 2FA válido para habilitar 2FA.
fa: توکن 2fa ارائه شده توسط درخواست نامعتبر بود. یک توکن معتبر 2fa برای فعال کردن 2fa لازم است.
fr: Le jeton 2FA fourni par la requête était invalide. Un jeton 2FA valide est requis pour activer la 2FA.
hi: अनुरोध द्वारा प्रदान किया गया 2fa टोकन अमान्य था। 2fa सक्षम करने के लिए वैध 2fa टोकन आवश्यक है।
nl: De 2FA-token geleverd door het verzoek was ongeldig. Een geldige 2FA-token is vereist om 2FA in te schakelen.
sv: 2FA-token som tillhandahölls av förfrågan var ogiltig. En giltig 2FA-token krävs för att aktivera 2FA.

# TfaConfigureAutAppTitle
source: Configure authenticator app
ar: حمّل تطبيق مصادقة ثنائية مثل Google Authenticator لـ {0} و {1}.
de: Authentifizierungs-App konfigurieren
es: Configurar app autenticadora
fa: پیکربندی برنامه احراز هویت
fr: Configurer l'application d'authentification
hi: प्रमाणीकरण ऐप कॉन्फ़िगर करें
nl: Authenticator-app configureren
sv: Konfigurera autentiseringsapp

# TfaConfigureAutAppSubtitle
source: To use an authenticator app go through the following steps:
ar: امسح/انقر على رمز QR أو أدخل المفتاح التالي في تطبيق المصادقة الثنائية (المسافات وحساسية الأحرف غير مهمة):
de: Um eine Authentifizierungs-App zu verwenden, gehen Sie die folgenden Schritte durch:
es: Para usar una app autenticadora, sigue estos pasos:
fa: برای استفاده از برنامه احراز هویت مراحل زیر را طی کنید:
fr: Pour utiliser une application d'authentification, suivez ces étapes :
hi: प्रमाणीकरण ऐप का उपयोग करने के लिए निम्नलिखित चरणों का पालन करें:
nl: Om een authenticator-app te gebruiken, volg deze stappen:
sv: För att använda en autentiseringsapp, följ dessa steg:

# TfaConfigureAutAppStep1
source: Download a two-factor authenticator app like Google Authenticator for {0} and {1}.
ar: بعد مسح رمز QR أو إدخال المفتاح أعلاه، سيوفر تطبيق المصادقة الثنائية كودًا فريدًا. أدخل الكود في مربع التأكيد أدناه.
de: Laden Sie eine Zwei-Faktor-Authentifizierungs-App wie Google Authenticator für {0} und {1} herunter.
es: Descarga una app autenticadora de dos factores como Google Authenticator para {0} y {1}.
fa: دانلود یک برنامه احراز هویت دو مرحله ای مانند Google Authenticator برای {0} و {1}.
fr: Téléchargez une application d'authentification à deux facteurs comme Google Authenticator pour {0} et {1}.
hi: {0} और {1} के लिए Google Authenticator जैसा दो-कारक प्रमाणीकरण ऐप डाउनलोड करें।
nl: Download een twee-factor authenticator-app zoals Google Authenticator voor {0} en {1}.
sv: Ladda ner en tvåfaktorsautentiseringsapp som Google Authenticator för {0} och {1}.

# TfaConfigureAutAppStep2
source: Scan/click the QR Code or enter the following key into your two factor authenticator app (spaces and casing do not matter):
ar: تم تمكين المصادقة الثنائية.
de: Scannen/Klicken Sie den QR-Code oder geben Sie den folgenden Schlüssel in Ihre Zwei-Faktor-Authentifizierungs-App ein (Leerzeichen und Groß-/Kleinschreibung sind egal):
es: Escanea/haz clic en el código QR o ingresa la siguiente clave en tu app autenticadora de dos factores (los espacios y mayúsculas no importan):
fa: کد QR را اسکن یا کلیک کنید یا کلید زیر را در برنامه احراز هویت دو عاملی خود وارد کنید (فضاها و بدنه مهم نیستند):
fr: Scannez/cliquez sur le code QR ou saisissez la clé suivante dans votre application d'authentification à deux facteurs (les espaces et la casse n'ont pas d'importance) :
hi: QR कोड स्कैन/क्लिक करें या निम्न कुंजी को अपने दो कारक प्रमाणीकरण ऐप में दर्ज करें (स्पेस और केसिंग मायने नहीं रखती):
nl: Scan/klik op de QR-code of voer de volgende sleutel in uw twee-factor authenticator-app in (spaties en hoofdletters doen er niet toe):
sv: Skanna/klicka på QR-koden eller ange följande nyckel i din tvåfaktorsautentiseringsapp (mellanslag och skiftläge spelar ingen roll):

# TfaConfigureAutAppStep3
source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
ar: تم تعطيل المصادقة الثنائية.
de: Sobald Sie den QR-Code gescannt oder den obigen Schlüssel eingegeben haben, stellt Ihre Zwei-Faktor-Authentifizierungs-App Ihnen einen eindeutigen Code zur Verfügung. Geben Sie den Code in das Bestätigungsfeld unten ein.
es: Una vez que hayas escaneado el código QR o ingresado la clave anterior, tu app de autenticación de dos factores te proporcionará un código único. Ingresa el código en el cuadro de confirmación a continuación.
fa: هنگامی که کد QR را اسکن کردید یا کلید بالا را وارد کردید، برنامه احراز هویت دو عاملی شما یک کد منحصر به فرد را در اختیار شما قرار می دهد. کد را در کادر تایید زیر وارد کنید.
fr: Une fois que vous avez scanné le code QR ou saisi la clé ci-dessus, votre application d'authentification à deux facteurs vous fournira un code unique. Saisissez le code dans la boîte de confirmation ci-dessous.
hi: एक बार जब आप QR कोड स्कैन कर लें या ऊपर की कुंजी इनपुट कर लें, तो आपका दो कारक प्रमाणीकरण ऐप आपको एक अद्वितीय कोड प्रदान करेगा। नीचे पुष्टि बॉक्स में कोड दर्ज करें।
nl: Zodra u de QR-code hebt gescand of de sleutel hierboven hebt ingevoerd, zal uw twee-factor authenticatie-app u een unieke code geven. Voer de code in het bevestigingsvak hieronder in.
sv: När du har skannat QR-koden eller angett nyckeln ovan kommer din tvåfaktorsautentiseringsapp att ge dig en unik kod. Ange koden i bekräftelsefältet nedan.

# TwoFactorAuthenticationEnabled
source: Two-factor authentication has been enabled.
ar: كود التحقق:
de: Zwei-Faktor-Authentifizierung wurde aktiviert.
es: La autenticación de dos factores ha sido habilitada.
fa: احراز هویت دو مرحله‌ای فعال شد.
fr: L'authentification à deux facteurs a été activée.
hi: दो-कारक प्रमाणीकरण सक्षम हो गया है।
nl: Twee-factor authenticatie is ingeschakeld.
sv: Tvåfaktorsautentisering har aktiverats.

# TwoFactorAuthenticationDisabled
source: Two-factor authentication has been disabled.
ar: أدخل كود التحقق.
de: Zwei-Faktor-Authentifizierung wurde deaktiviert.
es: La autenticación de dos factores ha sido deshabilitada.
fa: احراز هویت دو مرحله‌ای غیرفعال شد.
fr: L'authentification à deux facteurs a été désactivée.
hi: दो-कारक प्रमाणीकरण अक्षम हो गया है।
nl: Twee-factor authenticatie is uitgeschakeld.
sv: Tvåfaktorsautentisering har inaktiverats.

# TfaConfigureAutAppVerificationCodeLabel
source: Verification Code:
ar: التحقق
de: Verifizierungscode:
es: Código de verificación:
fa: کد تایید:
fr: Code de vérification :
hi: सत्यापन कोड:
nl: Verificatiecode:
sv: Verifieringskod:

# TfaConfigureAutAppVerificationCodePlaceholder
source: Enter verification code.
ar: الاسترداد
de: Verifizierungscode eingeben.
es: Ingresa el código de verificación.
fa: لطفا کد تایید را وارد کنید.
fr: Saisir le code de vérification.
hi: सत्यापन कोड दर्ज करें।
nl: Voer verificatiecode in.
sv: Ange verifieringskod.

# TfaConfigureAutAppVerifyButtonText
source: Verify
ar: لا توجد أكواد استرداد متبقية.
de: Verifizieren
es: Verificar
fa: تأیید
fr: Vérifier
hi: सत्यापित करें
nl: Verifiëren
sv: Verifiera

# TfaRecoveryCodesHeader
source: Recovery
ar: يجب إنشاء مجموعة جديدة من أكواد الاسترداد قبل تسجيل الدخول بكود استرداد.
de: Wiederherstellung
es: Recuperación
fa: بازیابی
fr: Récupération
hi: रिकवरी
nl: Herstel
sv: Återställning

# TfaRecoveryCodesZeroLeftTitle
source: You have no recovery codes left.
ar: تبقى لديك كود استرداد واحد.
de: Sie haben keine Wiederherstellungscodes mehr.
es: No te quedan códigos de recuperación.
fa: هیچ کد بازیابی ندارید.
fr: Vous n'avez plus de codes de récupération.
hi: आपके पास कोई रिकवरी कोड बाकी नहीं हैं।
nl: U hebt geen herstelcodes meer.
sv: Du har inga återställningkoder kvar.

# TfaRecoveryCodesZeroLeftSubtitle
source: You must generate a new set of recovery codes before you can log in with a recovery code.
ar: يمكنك إنشاء مجموعة جديدة من أكواد الاسترداد.
de: Sie müssen einen neuen Satz Wiederherstellungscodes generieren, bevor Sie sich mit einem Wiederherstellungscode anmelden können.
es: Debes generar un nuevo conjunto de códigos de recuperación antes de poder iniciar sesión con un código de recuperación.
fa: قبل از اینکه بتوانید با کد بازیابی وارد شوید، باید مجموعه جدیدی از کدهای بازیابی را ایجاد کنید.
fr: Vous devez générer un nouveau jeu de codes de récupération avant de pouvoir vous connecter avec un code de récupération.
hi: रिकवरी कोड से साइन इन करने से पहले आपको नई रिकवरी कोड सेट उत्पन्न करनी होगी।
nl: U moet een nieuwe set herstelcodes genereren voordat u kunt aanmelden met een herstelcode.
sv: Du måste generera ett nytt set återställningkoder innan du kan logga in med en återställningkod.

# TfaRecoveryCodesOneLeftTitle
source: You have 1 recovery code left.
ar: تبقى لديك {0} أكواد استرداد.
de: Sie haben 1 Wiederherstellungscode übrig.
es: Te queda 1 código de recuperación.
fa: شما 1 کد بازیابی باقی مانده است.
fr: Il vous reste 1 code de récupération.
hi: आपके पास 1 रिकवरी कोड बाकी है।
nl: U hebt nog 1 herstelcode.
sv: Du har 1 återställningskod kvar.

# TfaRecoveryCodesOneLeftSubtitle
source: You can generate a new set of recovery codes.
ar: يجب أن تنشئ مجموعة جديدة من أكواد الاسترداد.
de: Sie können einen neuen Satz Wiederherstellungscodes generieren.
es: Puedes generar un nuevo conjunto de códigos de recuperación.
fa: می توانید مجموعه جدیدی از کدهای بازیابی را ایجاد کنید.
fr: Vous pouvez générer un nouveau jeu de codes de récupération.
hi: आप नई रिकवरी कोड सेट उत्पन्न कर सकते हैं।
nl: U kunt een nieuwe set herstelcodes genereren.
sv: Du kan generera ett nytt set återställningkoder.

# TfaRecoveryCodesThreeLeftTitle
source: You have {0} recovery codes left.
ar: إنشاء أكواد استرداد جديدة لا يغير المفاتيح المستخدمة في تطبيقات المصادقة. إذا كنت ترغب في تغيير المفتاح المستخدم في تطبيق مصادقة، يجب إعادة تعيين مفاتيح المصادقة في علامة التبويب التالية.
de: Sie haben {0} Wiederherstellungscodes übrig.
es: Te quedan {0} códigos de recuperación.
fa: شما {0} کد بازیابی باقی مانده است.
fr: Il vous reste {0} codes de récupération.
hi: आपके पास {0} रिकवरी कोड बाकी हैं।
nl: U hebt nog {0} herstelcodes.
sv: Du har {0} återställningkoder kvar.

# TfaRecoveryCodesThreeLeftSubtitle
source: You should generate a new set of recovery codes.
ar: إنشاء أكواد استرداد
de: Sie sollten einen neuen Satz Wiederherstellungscodes generieren.
es: Deberías generar un nuevo conjunto de códigos de recuperación.
fa: شما باید مجموعه جدیدی از کدهای بازیابی را ایجاد کنید.
fr: Vous devriez générer un nouveau jeu de codes de récupération.
hi: आपको नई रिकवरी कोड सेट उत्पन्न करनी चाहिए।
nl: U zou een nieuwe set herstelcodes moeten genereren.
sv: Du bör generera ett nytt set återställningkoder.

# TfaRecoveryCodesGenerateWraning
source: Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should reset your authenticator keys in the next tab.
ar: ضع هذه الأكواد في مكان آمن.
de: Das Generieren neuer Wiederherstellungscodes ändert nicht die Schlüssel, die in Authentifizierungs-Apps verwendet werden. Wenn Sie den in einer Authentifizierungs-App verwendeten Schlüssel ändern möchten, sollten Sie Ihre Authentifizierungsschlüssel im nächsten Tab zurücksetzen.
es: Generar nuevos códigos de recuperación no cambia las claves usadas en las apps autenticadoras. Si deseas cambiar la clave usada en una app autenticadora, restablece tus claves autenticadoras en la siguiente pestaña.
fa: ایجاد کدهای بازیابی جدید، کلیدهای مورد استفاده در برنامه های احراز هویت را تغییر نمی دهد. اگر می خواهید کلید مورد استفاده در یک برنامه احراز هویت را تغییر دهید، باید کلیدهای احراز هویت خود را در تب بعدی بازنشانی کنید.
fr: La génération de nouveaux codes de récupération ne change pas les clés utilisées dans les applications d'authentification. Si vous souhaitez changer la clé utilisée dans une application d'authentification, vous devez réinitialiser vos clés d'authentification dans l'onglet suivant.
hi: नई रिकवरी कोड उत्पन्न करने से प्रमाणीकरण ऐप्स में उपयोग की जाने वाली कुंजियाँ नहीं बदलतीं। यदि आप प्रमाणीकरण ऐप में उपयोग की जाने वाली कुंजी बदलना चाहते हैं तो आपको अगले टैब में अपने प्रमाणीकरण कुंजियाँ रीसेट करनी चाहिए।
nl: Het genereren van nieuwe herstelcodes verandert de sleutels die in authenticator-apps worden gebruikt niet. Als u de sleutel in een authenticator-app wilt wijzigen, moet u uw authenticator-sleutels resetten in het volgende tabblad.
sv: Generering av nya återställningkoder ändrar inte nycklarna som används i autentiseringsappar. Om du vill ändra nyckeln i en autentiseringsapp ska du återställa dina autentiseringsnycklar i nästa flik.

# TfaRecoveryCodesGenerateButtonText
source: Generate Recovery Codes
ar: إذا فقدت جهاز المصادقة وليس لديك أكواد الاسترداد، ستفقد الوصول إلى حسابك.
de: Wiederherstellungscodes generieren
es: Generar códigos de recuperación
fa: کدهای بازیابی را ایجاد کنید
fr: Générer des codes de récupération
hi: रिकवरी कोड उत्पन्न करें
nl: Genereer herstelcodes
sv: Generera återställningkoder

# TfaRecoveryCodesWarningTitle
source: Put these codes in a safe place.
ar: أكواد الاسترداد:
de: Bewahren Sie diese Codes an einem sicheren Ort auf.
es: Guarda estos códigos en un lugar seguro.
fa: این کدها را در مکانی امن قرار دهید.
fr: Mettez ces codes en lieu sûr.
hi: इन कोड्स को सुरक्षित स्थान पर रखें।
nl: Bewaar deze codes op een veilige plaats.
sv: Lägg dessa koder på en säker plats.
