Repository: bitfoundation/bitplatform
Catalog: src/Templates/Boilerplate/Bit.Boilerplate/src/Shared/Resources/AppStrings.*.resx
Languages: ar, de, es, fa, fr, hi, nl, sv

# ProductsPercentagePerCategoryText
source: This chart shows the percentage of products in each category.
ar: المنتجات
de: Dieses Diagramm zeigt den Prozentsatz der Produkte in jeder Kategorie.
es: Este gráfico muestra el porcentaje de productos en cada categoría.
fa: این نمودار درصد محصولات هر دسته را نشان می دهد.
fr: Ce graphique montre le pourcentage de produits dans chaque catégorie.
hi: यह चार्ट प्रत्येक कैटेगरी में उत्पादों का प्रतिशत दिखाता है।
nl: Deze grafiek toont het percentage producten in elke categorie.
sv: Detta diagram visar andelen produkter i varje kategori.

source: Categories
ar: تحتوي هذه الفئة على بعض المنتجات، لذا لا يمكن حذفها
de: Kategorien
es: Categorías
fa: دسته ها
fr: Catégories
hi: कैटेगरी
nl: Categorieën
sv: Kategorier

source: Products
ar: هل أنت متأكد من رغبتك في حذف المنتج {0}
de: Produkte
es: Productos
fa: محصولات
fr: Produits
hi: उत्पाद
nl: Producten
sv: Produkter

# CategoryNotEmpty
source: This category contain some products, so you can't delete it
ar: حذف المنتج
de: Diese Kategorie enthält Produkte, daher können Sie sie nicht löschen
es: Esta categoría contiene algunos productos, por lo que no puedes eliminarla
fa: این دسته دارای محصول است، بنابراین نمی توانید ان را حذف کنید
fr: Cette catégorie contient des produits, vous ne pouvez pas la supprimer
hi: इस कैटेगरी में कुछ उत्पाद हैं, इसलिए आप इसे हटा नहीं सकते
nl: Deze categorie bevat producten, dus u kunt deze niet verwijderen
sv: Kategorin innehåller produkter och kan därför inte tas bort

# AreYouSureWannaDeleteProduct
source: Are you sure you want to delete product {0}
ar: مختار اللون الافتراضي
de: Sind Sie sicher, dass Sie das Produkt {0} löschen möchten?
es: ¿Estás seguro de que quieres eliminar el producto {0}?
fa: آیا مطمئن هستید که می خواهید محصول {0} را حذف کنید؟
fr: Êtes-vous sûr de vouloir supprimer le produit {0}
hi: क्या आप वाकई उत्पाद {0} को हटाना चाहते हैं
nl: Weet u zeker dat u product {0} wilt verwijderen
sv: Är du säker på att du vill ta bort produkten {0}?

source: Delete product
ar: تعديل المنتج {0}
de: Produkt löschen
es: Eliminar producto
fa: حذف محصول
fr: Supprimer le produit
hi: उत्पाद हटाएं
nl: Verwijder product
sv: Ta bort produkt

source: Default color picker
ar: اسم منتج مكرر
de: Standard-Farbauswähler
es: Selector de color predeterminado
fa: انتخاب کننده رنگ پیش فرض
fr: Sélecteur de couleur par défaut
hi: डिफ़ॉल्ट रंग पिकर
nl: Standaard kleurkiezer
sv: Standard färgväljare

source: Edit product
ar: فئة مكررة {0}
de: Produkt {0} bearbeiten
es: Editar producto {0}
fa: ویرایش محصول {0}
fr: Modifier le produit {0}
hi: उत्पाद {0} संपादित करें
nl: Bewerk product {0}
sv: Redigera produkt {0}

source: Duplicate product name
ar: لوحة التحكم
de: Doppelter Produktname
es: Nombre de producto duplicado
fa: نام محصول تکراری است
fr: Nom de produit dupliqué
hi: डुप्लिकेट उत्पाद नाम
nl: Dubbele productnaam
sv: Dubblerat produktnamn

source: Duplicate category name
ar: لوحة التحكم
de: Doppelte Kategorie {0}
es: Categoría duplicada {0}
fa: نام دسته {0} تکراری است
fr: Catégorie dupliquée {0}
hi: डुप्लिकेट कैटेगरी {0}
nl: Dubbele categorie {0}
sv: Dubblerad kategori {0}

# DashboardPageTitle
source: Dashboard
ar: إليك بيانات التحليل الخاصة بك
es: Tablero
fa: داشبورد
fr: Tableau de bord
hi: डैशबोर्ड
sv: Översikt

source: Dashboard
ar: استجابة Google reCAPTCHA غير صالحة.
es: Tablero
fa: داشبورد
fr: Tableau de bord
hi: डैशबोर्ड
sv: Översikt

# DashboardSubtitle
source: Here's your analytic data
ar: يجب اجتياز تحدي Google reCAPTCHA.
de: Hier sind Ihre Analysedaten
es: Aquí están tus datos analíticos
fa: داده های تحلیلی شما
fr: Voici vos données analytiques
hi: यहाँ आपका विश्लेषणात्मक डेटा है
nl: Hier zijn uw analysegegevens
sv: Här är dina analysdata

source: Invalid Google reCAPTCHA response.
ar: منتجات مشابهة
de: Ungültige Google reCAPTCHA-Antwort.
es: Respuesta de Google reCAPTCHA inválida.
fa: پاسخ گوگل ریکپچا نامعتبر است.
fr: Réponse reCAPTCHA Google invalide.
hi: अमान्य Google reCAPTCHA प्रतिक्रिया।
nl: Ongeldig Google reCAPTCHA-antwoord.
sv: Ogiltigt Google reCAPTCHA-svar.

# InvalidGoogleRecaptchaChallenge
source: You need to pass the Google reCAPTCHA challenge.
ar: منتجات في نفس الفئة
de: Sie müssen die Google reCAPTCHA-Prüfung bestehen.
es: Debes pasar el desafío de Google reCAPTCHA.
fa: شما باید چالش گوگل ریکپچا را به سرانجام برسانید.
fr: Vous devez passer le défi reCAPTCHA Google.
hi: आपको Google reCAPTCHA चुनौती पास करनी होगी।
nl: U moet de Google reCAPTCHA-uitdaging doorstaan.
sv: Du måste klara Google reCAPTCHA-utmaningen.

source: Similar products
ar: شراء
de: Ähnliche Produkte
es: Productos similares
fa: محصولات مشابه
fr: Produits similaires
hi: समान उत्पाद
nl: Vergelijkbare producten
sv: Liknande produkter

# SiblingProducts
source: Products in the same category
ar: تم الشراء بنجاح!
de: Produkte in derselben Kategorie
es: Productos en la misma categoría
fa: محصولات در همین دسته
fr: Produits de la même catégorie
hi: समान कैटेगरी में उत्पाद
nl: Producten in dezelfde categorie
sv: Produkter i samma kategori
