Repository: bitfoundation/bitplatform
Catalog: src/Templates/Boilerplate/Bit.Boilerplate/src/Shared/Resources/AppStrings.*.resx
Languages: ar, de, es, fa, fr, hi, nl, sv

source: Token
ar: الرمز
fa: توکن
fr: Jeton
hi: टोकन

source: Invalid token.
ar: رمز غير صالح.
de: Ungültiger Token.
es: Token inválido.
fa: توکن معتبر نیست.
fr: Jeton invalide.
hi: अमान्य टोकन।
nl: Ongeldige token.
sv: Ogiltig token.

source: Expired token.
ar: رمز منتهي الصلاحية.
de: Abgelaufener Token.
es: Token expirado.
fa: توکن منقضی شده است.
fr: Jeton expiré.
hi: समाप्त टोकन।
nl: Vervallen token.
sv: Utgånget token.

# SignInMessageInSignUp
source: Already have an account?
ar: هل لديك حساب بالفعل؟
de: Schon ein Konto?
es: ¿Ya tienes una cuenta?
fa: از قبل حساب کاربری دارید؟
fr: Vous avez déjà un compte ?
hi: पहले से खाता है?
nl: Hebt u al een account?
sv: Har du redan ett konto?

# ConfirmMessageInProfile
source: Already have a token?
ar: هل لديك رمز بالفعل؟
de: Schon einen Token?
es: ¿Ya tienes un token?
fa: توکنی از قبل دارید؟
fr: Vous avez déjà un jeton ?
hi: पहले से टोकन है?
nl: Hebt u al een token?
sv: Har du redan en token?

# ConfirmEmailHeaderText
source: Email Address
ar: عنوان البريد الإلكتروني
de: E-Mail-Adresse
es: Dirección de correo electrónico
fa: آدرس ایمیل
fr: Adresse e-mail
hi: ईमेल पता
nl: E-mailadres
sv: E-postadress

# ConfirmEmailSubtitle
source: We have sent a confirmation token to your email address.
ar: لقد أرسلنا رمز التأكيد إلى عنوان بريدك الإلكتروني.
de: Wir haben einen Bestätigungstoken an Ihre E-Mail-Adresse gesendet.
es: Hemos enviado un token de confirmación a tu dirección de correo electrónico.
fa: ما یک توکن به آدرس ایمیل شما ارسال کرده ایم.
fr: Nous avons envoyé un jeton de confirmation à votre adresse e-mail.
hi: हमने आपके ईमेल पते पर पुष्टि टोकन भेज दिया है।
nl: We hebben een bevestigingstoken naar uw e-mailadres verzonden.
sv: Vi har skickat en bekräftelsetoken till din e-postadress.

# ConfirmPageTitle
source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
fa: تایید
fr: Confirmer
hi: पुष्टि करें
nl: Bevestigen
sv: Bekräfta

# ConfirmTitle
source: Confirm your account
ar: تأكيد حسابك
de: Konto bestätigen
es: Confirmar tu cuenta
fa: تایید حساب کاربری
fr: Confirmer votre compte
hi: अपना खाता पुष्टि करें
nl: Bevestig uw account
sv: Bekräfta ditt konto

# ConfirmEmailMessage
source: Please confirm your email by typing the token here.
ar: يرجى تأكيد بريدك الإلكتروني بكتابة الرمز هنا.
de: Bitte bestätigen Sie Ihre E-Mail, indem Sie den Token hier eingeben.
es: Confirma tu correo electrónico escribiendo el token aquí.
fa: لطفا ایمیل خود را با تایپ توکن در اینجا تایید کنید.
fr: Veuillez confirmer votre e-mail en saisissant le jeton ici.
hi: कृपया टोकन टाइप करके अपना ईमेल पुष्टि करें।
nl: Bevestig uw e-mail door de token hier in te typen.
sv: Vänligen bekräfta din e-post genom att skriva in koden här.

# EmailPlaceholder
source: Enter email address
ar: أدخل عنوان البريد الإلكتروني
de: E-Mail-Adresse eingeben
es: Ingresar dirección de correo electrónico
fa: آدرس ایمیل را وارد کنید
fr: Saisir l'adresse e-mail
hi: ईमेल पता दर्ज करें
nl: Voer e-mailadres in
sv: Ange e-postadress

source: Email Token
ar: الكود
de: Code
es: Código
fa: توکن ایمیل
fr: Code
hi: कोड
nl: Code
sv: Kod

# EmailTokenConfirmButtonText
source: Confirm Email Address
ar: تأكيد عنوان البريد الإلكتروني
de: E-Mail-Adresse bestätigen
es: Confirmar dirección de correo electrónico
fa: تایید آدرس ایمیل
fr: Confirmer l'adresse e-mail
hi: ईमेल पता पुष्टि करें
nl: Bevestig e-mailadres
sv: Bekräfta e-postadress

# EmailConfirmationSuccessTitle
source: Your email address ({0}) has been confirmed.
ar: تم تأكيد عنوان بريدك الإلكتروني ({0}).
de: Ihre E-Mail-Adresse ({0}) wurde bestätigt.
es: Tu dirección de correo electrónico ({0}) ha sido confirmada.
fa: آدرس ایمیل شما ({0}) تایید شد.
fr: Votre adresse e-mail ({0}) a été confirmée.
hi: आपका ईमेल पता ({0}) पुष्टि हो गया है।
nl: Uw e-mailadres ({0}) is bevestigd.
sv: Din e-postadress ({0}) har bekräftats.

# EmailConfirmationSuccessMessage
source: You can now login with your account.
ar: يمكنك الآن تسجيل الدخول بحسابك.
de: Sie können sich jetzt mit Ihrem Konto anmelden.
es: Ahora puedes iniciar sesión con tu cuenta.
fa: اکنون می توانید با حساب کاربری خود وارد شوید.
fr: Vous pouvez maintenant vous connecter à votre compte.
hi: आप अब अपने खाते से साइन इन कर सकते हैं।
nl: U kunt nu aanmelden met uw account.
sv: Du kan nu logga in med ditt konto.

# ConfirmPhoneHeaderText
source: Phone Number
ar: رقم الهاتف
de: Telefonnummer
es: Número de teléfono
fa: شماره تلفن
fr: Numéro de téléphone
hi: फ़ोन नंबर
nl: Telefoonnummer
sv: Telefonnummer

# ConfirmPhoneSubtitle
source: We have sent a confirmation token to your phone.
ar: لقد أرسلنا رمز التأكيد إلى هاتفك.
de: Wir haben einen Bestätigungstoken an Ihr Telefon gesendet.
es: Hemos enviado un token de confirmación a tu teléfono.
fa: ما یک توکن به تلفن شما ارسال کرده ایم.
fr: Nous avons envoyé un jeton de confirmation à votre téléphone.
hi: हमने आपके फ़ोन पर पुष्टि टोकन भेज दिया है।
nl: We hebben een bevestigingstoken naar uw telefoon verzonden.
sv: Vi har skickat en bekräftelsekod till din telefon.

# ConfirmPhoneMessage
source: Please confirm your phone number by typing the token here.
ar: يرجى تأكيد رقم هاتفك بكتابة الرمز هنا.
de: Bitte bestätigen Sie Ihre Telefonnummer, indem Sie den Token hier eingeben.
es: Confirma tu número de teléfono escribiendo el token aquí.
fa: لطفاً شماره تلفن خود را با تایپ توکن در اینجا تأیید کنید.
fr: Veuillez confirmer votre numéro de téléphone en saisissant le jeton ici.
hi: कृपया टोकन टाइप करके अपना फ़ोन नंबर पुष्टि करें।
nl: Bevestig uw telefoonnummer door de token hier in te typen.
sv: Vänligen bekräfta ditt telefonnummer genom att skriva in koden här.

# PhoneNumberPlaceholder
source: Enter phone number
ar: أدخل رقم الهاتف
de: Telefonnummer eingeben
es: Ingresar número de teléfono
fa: شماره تلفن را وارد کنید
fr: Saisir le numéro de téléphone
hi: फ़ोन नंबर दर्ज करें
nl: Voer telefoonnummer in
sv: Ange telefonnummer

source: Phone Token
ar: الكود
de: Code
es: Código
fa: توکن تلفن
fr: Code
hi: कोड
nl: Code
sv: Kod

# PhoneTokenConfirmButtonText
source: Confirm Phone Number
ar: تأكيد رقم الهاتف
de: Telefonnummer bestätigen
es: Confirmar número de teléfono
fa: تایید شماره تلفن
fr: Confirmer le numéro de téléphone
hi: फ़ोन नंबर पुष्टि करें
nl: Bevestig telefoonnummer
sv: Bekräfta telefonnummer

# NotReceivedPhoneMessage
source: Haven’t you received the token on your phone?
ar: ألم تتلق الرمز على هاتفك؟
de: Haben Sie den Token auf Ihrem Telefon nicht erhalten?
es: ¿No has recibido el token en tu teléfono?
fa: آیا توکن تلفن خود را دریافت نکرده اید؟
fr: Vous n'avez pas reçu le jeton sur votre téléphone ?
hi: क्या आपको फ़ोन पर टोकन प्राप्त नहीं हुआ?
nl: Hebt u de token niet ontvangen op uw telefoon?
sv: Har du inte fått koden på din telefon?

# ResendPhoneTokenButtonText
source: Resend Phone Token
ar: إعادة إرسال الكود
de: Code erneut senden
es: Reenviar código
fa: ارسال دوباره توکن تلفن
fr: Renvoyer le code
hi: कोड पुनः भेजें
nl: Code opnieuw verzenden
sv: Skicka kod igen

# PhoneConfirmationSuccessTitle
source: Your phone number ({0}) has been confirmed.
ar: تم تأكيد رقم هاتفك ({0}).
de: Ihre Telefonnummer ({0}) wurde bestätigt.
es: Tu número de teléfono ({0}) ha sido confirmado.
fa: شماره تلفن شما ({0}) تایید شد.
fr: Votre numéro de téléphone ({0}) a été confirmé.
hi: आपका फ़ोन नंबर ({0}) पुष्टि हो गया है।
nl: Uw telefoonnummer ({0}) is bevestigd.
sv: Ditt telefonnummer ({0}) har bekräftats.

# PhoneConfirmationSuccessMessage
source: You can now login with your account.
ar: يمكنك الآن تسجيل الدخول بحسابك.
de: Sie können sich jetzt mit Ihrem Konto anmelden.
es: Ahora puedes iniciar sesión con tu cuenta.
fa: اکنون می توانید با حساب کاربری خود وارد شوید.
fr: Vous pouvez maintenant vous connecter à votre compte.
hi: आप अब अपने खाते से साइन इन कर सकते हैं।
nl: U kunt nu aanmelden met uw account.
sv: Du kan nu logga in med ditt konto.

# AccountTitle
source: Account
ar: الحساب
de: Konto
es: Cuenta
fa: حساب کاربری
fr: Compte
hi: खाता
sv: Konto

# AccountSubtitle
source: Change your account email or phone number
ar: غيّر بريد حسابك الإلكتروني أو رقم الهاتف أو إعدادات تسجيل الدخول بدون كلمة مرور
de: Ändern Sie die E-Mail, Telefonnummer oder passwortlose Einstellungen Ihres Kontos
es: Cambia el correo electrónico, número de teléfono o configuraciones sin contraseña de tu cuenta
fa: ایمیل، شماره تلفن یا تنظیمات بی رمز حساب کاربری خود را تغییر دهید
fr: Changer l'e-mail, le numéro de téléphone ou les paramètres sans mot de passe de votre compte
hi: अपने खाते का ईमेल, फ़ोन नंबर, या पासवर्डलेस सेटिंग्स बदलें
nl: Wijzig het e-mailadres, telefoonnummer of wachtwoordloze instellingen van uw account
sv: Byt e-postadress för kontot, telefonnummer eller inställningar för lösenordslös inloggning.

source: Delete Account
ar: حذف الحساب
de: Konto löschen
es: Eliminar cuenta
fa: حذف حساب
fr: Supprimer le compte
hi: खाता हटाएं
nl: Account verwijderen
sv: Ta bort konto

# DeleteAccountPrompt
source: Are you sure you want to delete your account?
ar: هل أنت متأكد من رغبتك في حذف حسابك؟
de: Sind Sie sicher, dass Sie Ihr Konto löschen möchten?
es: ¿Estás seguro de que deseas eliminar tu cuenta?
fa: آیا مطمئن هستید که می خواهید حساب خود را حذف کنید؟
fr: Êtes-vous sûr de vouloir supprimer votre compte ?
hi: क्या आप वाकई अपना खाता हटाना चाहते हैं?
nl: Weet u zeker dat u uw account wilt verwijderen?
sv: Är du säker på att du vill ta bort ditt konto?

# DontHaveAccountMessage
source: Don’t have an account?
ar: ليس لديك حساب؟
de: Kein Konto?
es: ¿No tienes una cuenta?
fa: حساب ندارید؟
fr: Pas de compte ?
hi: खाता नहीं है?
nl: Hebt u nog geen account?
sv: Har du inget konto?

source: Edit
ar: تعديل
de: Bearbeiten
es: Editar
fa: ویرایش
fr: Modifier
hi: संपादित करें
nl: Bewerken
sv: Redigera

# FileUploadFailed
source: An error occurred while uploading file
ar: حدث خطأ أثناء رفع الملف
de: Ein Fehler ist beim Hochladen der Datei aufgetreten
es: Ocurrió un error al cargar el archivo
fa: هنگام بارگذاری فایل خطایی رخ داد
fr: Une erreur s'est produite lors du téléchargement du fichier
hi: फ़ाइल अपलोड करते समय त्रुटि हुई
nl: Er is een fout opgetreden tijdens het uploaden van het bestand
sv: Ett fel uppstod vid uppladdning av filen

# ForgotPasswordPageTitle
source: Forgot password
ar: نسيت كلمة المرور
de: Passwort vergessen
es: ¿Olvidaste tu contraseña?
fa: فراموشی رمزعبور
fr: Mot de passe oublié
hi: पासवर्ड भूल गए
nl: Wachtwoord vergeten
sv: Glömt lösenord

# ForgotPasswordTitle
source: Forgot password
ar: نسيت كلمة المرور
de: Passwort vergessen
es: ¿Olvidaste tu contraseña?
fa: رمزعبور را فراموش کردم
fr: Mot de passe oublié
hi: पासवर्ड भूल गए
nl: Wachtwoord vergeten
sv: Glömt lösenord

# ForgotPasswordMessage
source: Please enter your email address or phone number so we can send a reset password token to you.
ar: يرجى إدخال عنوان بريدك الإلكتروني أو رقم هاتفك حتى نرسل لك رمز إعادة تعيين كلمة المرور.
de: Bitte geben Sie Ihre E-Mail-Adresse oder Telefonnummer ein, damit wir einen Token zum Zurücksetzen des Passworts an Sie senden können.
es: Ingresa tu dirección de correo electrónico o número de teléfono para que podamos enviarte un token de restablecimiento de contraseña.
fa: لطفا آدرس ایمیل یا شماره تلفن خود را وارد کنید تا بتوانیم توکن بازنشانی رمزعبور را برای شما ارسال کنیم.
fr: Veuillez saisir votre adresse e-mail ou numéro de téléphone afin que nous puissions vous envoyer un jeton de réinitialisation de mot de passe.
hi: कृपया अपना ईमेल पता या फ़ोन नंबर दर्ज करें ताकि हम आपको रीसेट पासवर्ड टोकन भेज सकें।
nl: Voer uw e-mailadres of telefoonnummer in zodat we een reset-wachtwoordtoken naar u kunnen sturen.
sv: Ange din e-postadress eller telefonnummer så att vi kan skicka en kod för återställning av lösenord till dig.

# GenderMale
source: Male
ar: ذكر
de: Männlich
es: Masculino
fa: مرد
fr: Homme
hi: पुरुष
nl: Man
sv: Man

# GenderOther
source: Other
ar: آخر
de: Anderes
es: Otro
fa: غیره
fr: Autre
hi: अन्य
nl: Anders
sv: Annat

source: Go to today
ar: اذهب إلى اليوم
de: Zu heute gehen
es: Ir a hoy
fa: برو به امروز
fr: Aller à aujourd'hui
hi: आज पर जाएं
nl: Ga naar vandaag
sv: Gå till idag

# HomeMessage
source: Create your multi-mode (WASM, Server, Hybrid, pre-rendering) Blazor app easily in the shortest time ever!
ar: أنشئ تطبيق Blazor متعدد الوضعيات (WASM، الخادم، الهجين، التحضير المسبق) بسهولة في أقصر وقت ممكن!
de: Erstellen Sie Ihre Multi-Mode (WASM, Server, Hybrid, Pre-Rendering) Blazor-App in kürzester Zeit mühelos!
es: ¡Crea tu app Blazor multi-modo (WASM, Server, Hybrid, pre-rendering) fácilmente en el menor tiempo posible!
fa: برنامه blazor مالتی مد (WASM, Server, Hybrid, pre-rendering) خود را به آسانی و در سریع‌ترین زمان بسازید
fr: Créez facilement votre application Blazor multi-mode (WASM, Server, Hybrid, pré-rendu) en un temps record !
hi: अपना मल्टी-मोड (WASM, सर्वर, हाइब्रिड, पूर्व-रेंडरिंग) Blazor ऐप सबसे कम समय में आसानी से बनाएं!
nl: Maak eenvoudig uw multi-mode (WASM, Server, Hybrid, pre-rendering) Blazor-app in de kortst mogelijke tijd!
sv: Skapa din multimodala (WASM, Server, Hybrid, förrendering) Blazor-app enkelt på kortaste tid någonsin!

# HomePageTitle
source: Home
ar: الرئيسية
de: Startseite
es: Inicio
fa: خانه
fr: Accueil
hi: होम
sv: Hem

# HomePanelTitle
source: Build all of your apps
ar: بناء جميع تطبيقاتك
de: Bauen Sie all Ihre Apps
es: Construye todas tus apps
fa: تمام اپهای خود را بسازید
fr: Construisez toutes vos applications
hi: अपने सभी ऐप्स बनाएं
nl: Bouw al uw apps
sv: Bygg alla dina appar

# HomePanelSubtitle
source: using what you already know and love
ar: باستخدام ما تعرفه وتحبه بالفعل
de: mit dem, was Sie bereits kennen und lieben
es: usando lo que ya conoces y amas
fa: با استفاده چیزی که میدانید و دوستش دارید
fr: avec ce que vous connaissez et aimez déjà
hi: उसका उपयोग करके जो आप पहले से जानते और पसंद करते हैं
nl: met wat u al kent en leuk vindt
sv: med det du redan kan och älskar

source: Watch video
ar: شاهد الفيديو
de: Video ansehen
es: Ver video
fa: مشاهده ویدئو
fr: Regarder la vidéo
hi: वीडियो देखें
nl: Bekijk video
sv: Titta på video

source: Learn more
ar: تعلم المزيد
de: Mehr erfahren
es: Saber más
fa: بیشتر بدانید
fr: En savoir plus
hi: और जानें
nl: Meer informatie
sv: Läs mer

# BitPlatformMessage
source: A set of tools for .NET developers across multiple platforms
ar: مجموعة أدوات لمطوري .NET عبر منصات متعددة
de: Ein Satz von Tools für .NET-Entwickler auf mehreren Plattformen
es: Un conjunto de herramientas para desarrolladores .NET en múltiples plataformas
fa: ابزارهایی برای دولوپرهای دات نت در پلتفرهای گوناگون
fr: Un ensemble d'outils pour les développeurs .NET sur plusieurs plateformes
hi: एकाधिक प्लेटफ़ॉर्म्स पर .NET डेवलपर्स के लिए टूल्स का सेट
nl: Een set tools voor .NET-ontwikkelaars op meerdere platforms
sv: Ett verktygsset för .NET-utvecklare på flera plattformar

# BitBlazorUIMessage
source: A set of performant, easy-to-customize and beautiful Blazor components
ar: مجموعة مكونات Blazor أدائية، سهلة التخصيص وجميلة
de: Ein Satz performanter, leicht anpassbarer und schöner Blazor-Komponenten
es: Un conjunto de componentes Blazor de alto rendimiento, fáciles de personalizar y hermosos
fa: مجموعه ای از کمپوننتهای کارا، ساده و زیبای بلیزری
fr: Un ensemble de composants Blazor performants, faciles à personnaliser et beaux
hi: प्रदर्शनकारी, आसानी से अनुकूलित करने योग्य और सुंदर Blazor घटकों का सेट
nl: Een set hoogwaardige, eenvoudig aan te passen en mooie Blazor-componenten
sv: Ett set med presterande, lättanpassade och vackra Blazor-komponenter

# BitProjectTemplateMessage
source: A feature-rich .NET project template that works everywhere seamlessly
ar: قالب مشروع .NET غني بالميزات يعمل في كل مكان بسلاسة
de: Eine funktionsreiche .NET-Projektvorlage, die nahtlos überall funktioniert
es: Una plantilla de proyecto .NET rica en funciones que funciona perfectamente en todas partes
fa: تمپلیت پروژه ای فول امکانات که همه جا کار میکند
fr: Un modèle de projet .NET riche en fonctionnalités qui fonctionne partout de manière fluide
hi: एक फीचर-रिच .NET प्रोजेक्ट टेम्पलेट जो हर जगह सहजता से काम करता है
nl: Een rijk aan functies .NET-projecttemplate dat overal naadloos werkt
sv: En funktionsrik .NET-projektmall som fungerar sömlöst överallt

# DescriptionMetaTagValue
source: The Boilerplate is built with ASP.NET Core, Identity, Web API, EF Core and Blazor.
ar: تم بناء الـ Boilerplate باستخدام ASP.NET Core، Identity، Web API، EF Core و Blazor.
de: Das Boilerplate ist mit ASP.NET Core, Identity, Web API, EF Core und Blazor aufgebaut.
es: El Boilerplate está construido con ASP.NET Core, Identity, Web API, EF Core y Blazor.
fa: پروژه Boilerplate با ASP.NET Core, Identity, Web API, EF Core و Blazor ساخته شده
fr: Le Boilerplate est construit avec ASP.NET Core, Identity, Web API, EF Core et Blazor.
hi: बॉयलरप्लेट ASP.NET कोर, आइडेंटिटी, वेब API, EF कोर और Blazor के साथ बनाया गया है।
nl: De Boilerplate is gebouwd met ASP.NET Core, Identity, Web API, EF Core en Blazor.
sv: Boilerplate är byggt med ASP.NET Core, Identity, Web API, EF Core och Blazor.

source: New Password
ar: كلمة مرور جديدة
de: Neues Passwort
es: Nueva contraseña
fa: رمز عبور جدید
fr: Nouveau mot de passe
hi: नया पासवर्ड
nl: Nieuw wachtwoord
sv: Nytt lösenord

source: Old Password
ar: كلمة المرور القديمة
de: Altes Passwort
es: Contraseña anterior
fa: رمز عبور قبلی
fr: Ancien mot de passe
hi: पुराना पासवर्ड
nl: Oud wachtwoord
sv: Gammalt lösenord

source: No
ar: لا
de: Nein
fa: نه
fr: Non
hi: नहीं
nl: Nee
sv: Nej

# NotReceivedEmailMessage
source: Haven’t you received the email?
ar: ألم تتلق البريد الإلكتروني؟
de: Haben Sie die E-Mail nicht erhalten?
es: ¿No has recibido el correo electrónico?
fa: ایمیلی دریافت نکرده اید؟
fr: Vous n'avez pas reçu l'e-mail ?
hi: क्या आपको ईमेल प्राप्त नहीं हुआ?
nl: Hebt u de e-mail niet ontvangen?
sv: Har du inte fått e-posten?

source: or
ar: أو
de: oder
es: o
fa: یا
fr: ou
hi: या
nl: of
sv: eller

source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fa: حذف
fr: Supprimer
hi: हटाएं
nl: Verwijderen
sv: Ta bort

# ResendEmailTokenButtonText
source: Resend Email Token
ar: إعادة إرسال الكود
de: Code erneut senden
es: Reenviar código
fa: ارسال دوباره ایمیل
fr: Renvoyer le code
hi: कोड पुनः भेजें
nl: Code opnieuw verzenden
sv: Skicka kod igen

# ResetPasswordPageTitle
source: Reset password
ar: إعادة تعيين كلمة المرور
de: Passwort zurücksetzen
es: Restablecer contraseña
fa: ریست رمز عبور
fr: Réinitialiser le mot de passe
hi: पासवर्ड रीसेट करें
nl: Wachtwoord resetten
sv: Återställ lösenord

source: Reset password
ar: إعادة تعيين كلمة المرور
de: Passwort zurücksetzen
es: Restablecer contraseña
fa: ریست رمز عبور
fr: Réinitialiser le mot de passe
hi: पासवर्ड रीसेट करें
nl: Wachtwoord resetten
sv: Återställ lösenord

# ResetPasswordTitle
source: Reset password
ar: إعادة تعيين كلمة المرور
de: Passwort zurücksetzen
es: Restablecer contraseña
fa: ریست رمز عبور
fr: Réinitialiser le mot de passe
hi: पासवर्ड रीसेट करें
nl: Wachtwoord resetten
sv: Återställ lösenord

# ResetPasswordSubtitle
source: We have sent a token to your phone or email.
ar: لقد أرسلنا رمزًا إلى هاتفك أو بريدك الإلكتروني.
de: Wir haben einen Token an Ihr Telefon oder Ihre E-Mail gesendet.
es: Hemos enviado un token a tu teléfono o correo electrónico.
fa: ما یک توکن به تلفن یا ایمیل شما ارسال کرده ایم.
fr: Nous avons envoyé un jeton à votre téléphone ou e-mail.
hi: हमने आपके फ़ोन या ईमेल पर टोकन भेज दिया है।
nl: We hebben een token naar uw telefoon of e-mail verzonden.
sv: Vi har skickat en kod till din telefon eller e-post.

# ResetPasswordMessage
source: Please submit the token together with your new password here.
ar: يرجى تقديم الرمز مع كلمة المرور الجديدة هنا.
de: Bitte reichen Sie den Token zusammen mit Ihrem neuen Passwort hier ein.
es: Envía el token junto con tu nueva contraseña aquí.
fa: لطفا توکن را همراه با رمز عبور جدید خود در اینجا ارسال کنید.
fr: Veuillez soumettre le jeton avec votre nouveau mot de passe ici.
hi: कृपया अपना नया पासवर्ड टोकन के साथ यहाँ सबमिट करें।
nl: Dien hier de token samen met uw nieuwe wachtwoord in.
sv: Vänligen skicka koden tillsammans med ditt nya lösenord här.

# ResetPasswordButtonText
source: Set Password
ar: تعيين كلمة المرور
de: Passwort festlegen
es: Establecer contraseña
fa: تغییر پسورد
fr: Définir le mot de passe
hi: पासवर्ड सेट करें
nl: Wachtwoord instellen
sv: Ange lösenord

# ResetPasswordSuccessTitle
source: Your password has been reset.
ar: تم إعادة تعيين كلمة المرور.
de: Ihr Passwort wurde zurückgesetzt.
es: Tu contraseña ha sido restablecida.
fa: رمزعبور شما بازنشانی شد.
fr: Votre mot de passe a été réinitialisé.
hi: आपका पासवर्ड रीसेट हो गया है।
nl: Uw wachtwoord is gereset.
sv: Ditt lösenord har återställts.

# ResetPasswordSuccessBody
source: You can now login with your password.
ar: يمكنك الآن تسجيل الدخول بكلمة المرور.
de: Sie können sich jetzt mit Ihrem Passwort anmelden.
es: Ahora puedes iniciar sesión con tu contraseña.
fa: اکنون می توانید با رمزعبور خود وارد شوید.
fr: Vous pouvez maintenant vous connecter avec votre mot de passe.
hi: आप अब अपने पासवर्ड से साइन इन कर सकते हैं।
nl: U kunt nu aanmelden met uw wachtwoord.
sv: Du kan nu logga in med ditt nya lösenord.

# ResetPasswordMessageInForgot
source: Already have a reset password token?
ar: هل لديك رمز إعادة تعيين كلمة مرور بالفعل؟
de: Schon einen Token zum Zurücksetzen des Passworts?
es: ¿Ya tienes un token de restablecimiento de contraseña?
fa: از قبل یک توکن بازنشانی رمزعبور دارید?
fr: Vous avez déjà un jeton de réinitialisation de mot de passe ?
hi: पहले से रीसेट पासवर्ड टोकन है?
nl: Hebt u al een reset-wachtwoordtoken?
sv: Har du redan en kod för återställning av lösenord?

source: Save
ar: حفظ
de: Speichern
es: Guardar
fa: ذخیره
fr: Enregistrer
hi: सहेजें
nl: Opslaan
sv: Spara

# SignInPageTitle
source: Sign in
ar: تسجيل الدخول
de: Anmelden
es: Iniciar sesión
fa: ورود به برنامه
fr: Se connecter
hi: साइन इन करें
nl: Aanmelden
sv: Logga in

# SignInPanelTitle
source: Welcome back
ar: مرحبًا
de: Willkommen
es: Bienvenido
fa: خوش آمدید
fr: Bienvenue
hi: स्वागत है
nl: Welkom
sv: Välkommen

# SignInPanelSubtitle
source: Sign in to your account with
ar: تابع مع
de: Fortfahren mit Ihrem
es: Continúa con tu
fa: وارد حساب کاربری خود شوید با
fr: Continuer avec votre
hi: अपने
nl: Ga door met uw
sv: Fortsätt med ditt

source: Continue
ar: تابع
de: Fortfahren
es: Continuar
fa: ادامه
fr: Continuer
hi: जारी रखें
nl: Doorgaan
sv: Fortsätt

# GoogleSignInButtonText
source: Sign in with Google
ar: تسجيل الدخول بـ Google
de: Mit Google anmelden
es: Iniciar sesión con Google
fa: ورود با گوگل
fr: Se connecter avec Google
hi: Google से साइन इन करें
nl: Aanmelden met Google
sv: Logga in med Google

# GitHubSignInButtonText
source: Sign in with GitHub
ar: تسجيل الدخول بـ GitHub
de: Mit GitHub anmelden
es: Iniciar sesión con GitHub
fa: ورود با گیتهاب
fr: Se connecter avec GitHub
hi: GitHub से साइन इन करें
nl: Aanmelden met GitHub
sv: Logga in med GitHub

# TwitterSignInButtonText
source: Sign in with Twitter (X)
ar: تسجيل الدخول بـ Twitter (X)
de: Mit Twitter (X) anmelden
es: Iniciar sesión con Twitter (X)
fa: ورود با توییتر (X)
fr: Se connecter avec Twitter (X)
hi: Twitter (X) से साइन इन करें
nl: Aanmelden met Twitter (X)
sv: Logga in med Twitter (X)

# AppleSignInButtonText
source: Sign in with Apple
ar: تسجيل الدخول بـ Apple
de: Mit Apple anmelden
es: Iniciar sesión con Apple
fa: ورود با اپل
fr: Se connecter avec Apple
hi: Apple से साइन इन करें
nl: Aanmelden met Apple
sv: Logga in med Apple

source: Sign out
ar: تسجيل الخروج
de: Abmelden
es: Cerrar sesión
fa: خروج از سیستم
fr: Se déconnecter
hi: साइन आउट करें
nl: Afmelden
sv: Logga ut
