Repository: bitfoundation/bitplatform
Catalog: src/Templates/Boilerplate/Bit.Boilerplate/src/Shared/Resources/AppStrings.*.resx
Languages: ar, de, es, fa, fr, hi, nl, sv

# TfaRecoveryCodesWarning
source: If you lose your authenticator device and don't have the recovery codes you will lose access to your account.
ar: المصادقة
de: Wenn Sie Ihr Authentifizierungsgerät verlieren und keine Wiederherstellungscodes haben, verlieren Sie den Zugriff auf Ihr Konto.
es: Si pierdes tu dispositivo autenticador y no tienes los códigos de recuperación, perderás el acceso a tu cuenta.
fa: اگر دستگاه احراز هویت خود را گم کنید و کدهای بازیابی را نداشته باشید، دسترسی به حساب خود را از دست خواهید داد.
fr: Si vous perdez votre appareil d'authentification et que vous n'avez pas les codes de récupération, vous perdrez l'accès à votre compte.
hi: यदि आप अपना प्रमाणीकरण डिवाइस खो देते हैं और रिकवरी कोड नहीं हैं तो आप अपने खाते तक पहुँच खो देंगे।
nl: Als u uw authenticator-apparaat verliest en geen herstelcodes hebt, verliest u de toegang tot uw account.
sv: Om du förlorar din autentiseringsenhet och inte har återställningskoderna förlorar du åtkomst till ditt konto.

# TfaRecoveryCodesTitle
source: Recovery codes:
ar: إذا أعدت تعيين مفتاح المصادقة، لن يعمل تطبيق المصادقة حتى تعيد تهيئته.
de: Wiederherstellungscodes:
es: Códigos de recuperación:
fa: کدهای بازیابی:
fr: Codes de récupération :
hi: रिकवरी कोड:
nl: Herstelcodes:
sv: Återställningkoder:

# TfaAuthAppHeader
source: Authenticator
ar: هذه العملية تعطل 2FA حتى تتحقق من تطبيق المصادقة. إذا لم تكمل تهيئة تطبيق المصادقة، قد تفقد الوصول إلى حسابك.
de: Authentifizierer
es: Autenticador
fa: برنامه
fr: Authentificateur
hi: प्रमाणीकरणकर्ता
sv: Autentisator

# TfaAuthAppWarningTitle
source: If you reset your authenticator key your authenticator app will not work until you reconfigure it.
ar: إعادة تعيين مفتاح المصادقة
de: Wenn Sie Ihren Authentifizierungsschlüssel zurücksetzen, funktioniert Ihre Authentifizierungs-App nicht mehr, bis Sie sie neu konfigurieren.
es: Si restableces tu clave autenticadora, tu app autenticadora no funcionará hasta que la reconfigures.
fa: اگر کلید احراز هویت خود را بازنشانی کنید، برنامه احراز هویت شما تا زمانی که آن را دوباره پیکربندی نکنید، کار نخواهد کرد.
fr: Si vous réinitialisez votre clé d'authentificateur, votre application d'authentification ne fonctionnera plus jusqu'à ce que vous la reconfiguriez.
hi: यदि आप अपनी प्रमाणीकरण कुंजी रीसेट करते हैं तो आपका प्रमाणीकरण ऐप पुन: कॉन्फ़िगर करने तक काम नहीं करेगा।
nl: Als u uw authenticator-sleutel reset, werkt uw authenticator-app niet meer totdat u deze opnieuw configureert.
sv: Om du återställer din autentiseringsnyckel kommer din autentiseringsapp inte att fungera förrän du konfigurerar om den.

# TfaAuthAppWarning
source: This process disables 2FA until you verify your authenticator app. If you do not complete your authenticator app configuration you may lose access to your account.
ar: تعطيل
de: Dieser Prozess deaktiviert 2FA, bis Sie Ihre Authentifizierungs-App verifiziert haben. Wenn Sie die Konfiguration Ihrer Authentifizierungs-App nicht abschließen, können Sie den Zugriff auf Ihr Konto verlieren.
es: Este proceso deshabilita 2FA hasta que verifiques tu app autenticadora. Si no completas la configuración de tu app autenticadora, podrías perder el acceso a tu cuenta.
fa: این فرآیند تا زمانی که برنامه احراز هویت خود را تأیید نکنید، 2FA را غیرفعال می کند. اگر پیکربندی برنامه authenticator خود را کامل نکنید، ممکن است دسترسی به حساب خود را از دست بدهید.
fr: Ce processus désactive la 2FA jusqu'à ce que vous vérifiiez votre application d'authentification. Si vous ne terminez pas la configuration de votre application d'authentification, vous risquez de perdre l'accès à votre compte.
hi: यह प्रक्रिया आपके प्रमाणीकरण ऐप को सत्यापित करने तक 2FA अक्षम कर देती है। यदि आप अपना प्रमाणीकरण ऐप कॉन्फ़िगरेशन पूरा नहीं करते हैं तो आप अपने खाते तक पहुँच खो सकते हैं।
nl: Dit proces schakelt 2FA uit totdat u uw authenticator-app verifieert. Als u de configuratie van uw authenticator-app niet voltooit, kunt u de toegang tot uw account verliezen.
sv: Denna process inaktiverar 2FA tills du verifierar din autentiseringsapp. Om du inte slutför konfigurationen av din autentiseringsapp riskerar du att förlora åtkomst till ditt konto.

# TfaAuthAppResetKeyButtonText
source: Reset authenticator key
ar: هذا الإجراء يعطل 2FA فقط.
de: Authentifizierungsschlüssel zurücksetzen
es: Restablecer clave autenticadora
fa: کلید احراز هویت را بازنشانی کنید
fr: Réinitialiser la clé d'authentificateur
hi: प्रमाणीकरण कुंजी रीसेट करें
nl: Reset authenticator-sleutel
sv: Återställ autentiseringsnyckel

# TfaDisable2faHeader
source: Disable
ar: تعطيل 2FA لا يغير المفاتيح المستخدمة في تطبيقات المصادقة. إذا كنت ترغب في تغيير المفتاح المستخدم في تطبيق مصادقة، يجب إعادة تعيين مفاتيح المصادقة في علامة التبويب السابقة.
de: Deaktivieren
es: Deshabilitar
fa: غیرفعالسازی
fr: Désactiver
hi: अक्षम करें
nl: Uitschakelen
sv: Inaktivera

# TfaDisable2faWarningTitle
source: This action only disables 2FA.
ar: تعطيل 2FA
de: Diese Aktion deaktiviert nur 2FA.
es: Esta acción solo deshabilita 2FA.
fa: این عمل فقط 2FA را غیرفعال می کند.
fr: Cette action désactive uniquement la 2FA.
hi: यह कार्रवाई केवल 2FA को अक्षम करती है।
nl: Deze actie schakelt alleen 2FA uit.
sv: Denna åtgärd inaktiverar endast 2FA.

# TfaDisable2faWarning
source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should reset your authenticator keys in the previous tab.
ar: تم إنشاء رمز 2FA وإرساله إليك.
de: Das Deaktivieren von 2FA ändert nicht die Schlüssel, die in Authentifizierungs-Apps verwendet werden. Wenn Sie den in einer Authentifizierungs-App verwendeten Schlüssel ändern möchten, sollten Sie Ihre Authentifizierungsschlüssel im vorherigen Tab zurücksetzen.
es: Deshabilitar 2FA no cambia las claves usadas en las apps autenticadoras. Si deseas cambiar la clave usada en una app autenticadora, restablece tus claves autenticadoras en la pestaña anterior.
fa: غیرفعال کردن 2FA کلیدهای مورد استفاده در برنامه های احراز هویت را تغییر نمی دهد. اگر می خواهید کلید مورد استفاده در یک برنامه احراز هویت را تغییر دهید، باید کلیدهای احراز هویت خود را در برگه قبلی بازنشانی کنید.
fr: La désactivation de la 2FA ne change pas les clés utilisées dans les applications d'authentification. Si vous souhaitez changer la clé utilisée dans une application d'authentification, vous devez réinitialiser vos clés d'authentification dans l'onglet précédent.
hi: 2FA अक्षम करने से प्रमाणीकरण ऐप्स में उपयोग की जाने वाली कुंजियाँ नहीं बदलतीं। यदि आप प्रमाणीकरण ऐप में उपयोग की जाने वाली कुंजी बदलना चाहते हैं तो आपको पिछले टैब में अपनी प्रमाणीकरण कुंजियाँ रीसेट करनी चाहिए।
nl: Het uitschakelen van 2FA verandert de sleutels die in authenticator-apps worden gebruikt niet. Als u de sleutel in een authenticator-app wilt wijzigen, moet u uw authenticator-sleutels resetten in het vorige tabblad.
sv: Inaktivering av 2FA ändrar inte nycklarna som används i autentiseringsappar. Om du vill ändra nyckeln i en autentiseringsapp ska du återställa dina autentiseringsnycklar i föregående flik.

# TfaDisable2faButtonText
source: Disable 2FA
ar: يرجى إدخال رمز الوصول المرتفع الذي أرسلناه للتو أو كود تطبيق المصادقة للمتابعة.
de: 2FA deaktivieren
es: Deshabilitar 2FA
fa: 2FA را غیرفعال کنید
fr: Désactiver la 2FA
hi: 2FA अक्षम करें
nl: Schakel 2FA uit
sv: Inaktivera 2FA

# TfaTokenSentMessage
source: The 2FA token has been generated and sent to you.
ar: {0} هو كودك في Boilerplate.
de: Der 2FA-Token wurde generiert und an Sie gesendet.
es: El token 2FA ha sido generado y enviado.
fa: توکن 2FA تولید و برای شما ارسال شده است.
fr: Le jeton 2FA a été généré et envoyé.
hi: 2FA टोकन उत्पन्न हो गया है और आपको भेज दिया गया है।
nl: De 2FA-token is gegenereerd en naar u verzonden.
sv: 2FA-token har genererats och skickats till dig.

# EnterElevatedAccessToken
source: Please enter the elevated access token we just sent you or your authenticator app code to continue.
ar: لقد طلبت بريد التأكيد بالفعل. جرب مرة أخرى بعد {0}
de: Bitte geben Sie den gerade gesendeten erhöhten Zugriffstoken oder den Code Ihrer Authentifizierungs-App ein, um fortzufahren.
es: Ingresa el token de acceso elevado que te acabamos de enviar o el código de tu app autenticadora para continuar.
fa: لطفا کد ۶ رقمی که ارسال کردیم یا کد Authenticator app خود را وارد کنید
fr: Veuillez saisir le jeton d'accès élevé que nous venons de vous envoyer ou le code de votre application d'authentification pour continuer.
hi: कृपया जारी रखने के लिए हमने अभी आपको भेजा गया उन्नत पहुँच टोकन या अपना प्रमाणीकरण ऐप कोड दर्ज करें।
nl: Voer de verhoogde toegangs-token in die we zojuist naar u hebben gestuurd of uw authenticator-app-code in om door te gaan.
sv: Ange den förhöjda åtkomsttoken vi just skickade till dig eller din autentiseringsappkod för att fortsätta.

# ElevatedAccessTokenShortText
source: {0} is your code in Boilerplate.
ar: لقد طلبت رسالة التأكيد النصية بالفعل. جرب مرة أخرى بعد {0}
de: {0} ist Ihr Code in Boilerplate.
es: {0} es tu código en Boilerplate.
fa: {0} کد شماست در Boilerplate
fr: {0} est votre code dans Boilerplate.
hi: {0} Boilerplate में आपका कोड है।
nl: {0} is uw code in Boilerplate.
sv: {0} är din kod i Boilerplate.

# WaitForEmailTokenRequestResendDelay
source: You have already requested the confirmation email. Try again in {0}
ar: لقد طلبت رمز إعادة تعيين كلمة المرور بالفعل. جرب مرة أخرى بعد {0}
de: Sie haben bereits die Bestätigungs-E-Mail angefordert. Versuchen Sie es in {0} erneut
es: Ya has solicitado el correo de confirmación. Intenta de nuevo en {0}
fa: شما قبلا ایمیل تایید را درخواست کرده اید. دوباره امتحان کنید در {0}
fr: Vous avez déjà demandé l'e-mail de confirmation. Réessayez dans {0}
hi: आपने पहले ही पुष्टि ईमेल का अनुरोध कर लिया है। {0} में पुनः प्रयास करें
nl: U hebt al een bevestigings-e-mail aangevraagd. Probeer het opnieuw over {0}
sv: Du har redan begärt bekräftelsee-posten. Försök igen om {0}

# WaitForPhoneNumberTokenRequestResendDelay
source: You have already requested the confirmation sms. Try again in {0}
ar: لقد طلبت OTP بالفعل. جرب مرة أخرى بعد {0}
de: Sie haben bereits die Bestätigungs-SMS angefordert. Versuchen Sie es in {0} erneut
es: Ya has solicitado el SMS de confirmación. Intenta de nuevo en {0}
fa: شما قبلا پیامک تایید را درخواست کرده اید. دوباره امتحان کنید در {0}
fr: Vous avez déjà demandé le SMS de confirmation. Réessayez dans {0}
hi: आपने पहले ही पुष्टि एसएमएस का अनुरोध कर लिया है। {0} में पुनः प्रयास करें
nl: U hebt al een bevestigings-sms aangevraagd. Probeer het opnieuw over {0}
sv: Du har redan begärt bekräftelse-SMS:et. Försök igen om {0}

# WaitForResetPasswordTokenRequestResendDelay
source: You have already requested the reset password token. Try again in {0}
ar: لقد طلبت رمز وصول مرتفع بالفعل. جرب مرة أخرى بعد {0}
de: Sie haben bereits den Token zum Zurücksetzen des Passworts angefordert. Versuchen Sie es in {0} erneut
es: Ya has solicitado el token de restablecimiento de contraseña. Intenta de nuevo en {0}
fa: شما قبلا توکن تغییر رمز‌عبور را درخواست کرده اید. دوباره امتحان کنید در {0}
fr: Vous avez déjà demandé le jeton de réinitialisation de mot de passe. Réessayez dans {0}
hi: आपने पहले ही रीसेट पासवर्ड टोकन का अनुरोध कर लिया है। {0} में पुनः प्रयास करें
nl: U hebt al een reset-wachtwoordtoken aangevraagd. Probeer het opnieuw over {0}
sv: Du har redan begärt kod för återställning av lösenord. Försök igen om {0}

# WaitForOtpRequestResendDelay
source: You have already requested an OTP. Try again in {0}
ar: OTP
de: Sie haben bereits einen OTP angefordert. Versuchen Sie es in {0} erneut
es: Ya has solicitado un OTP. Intenta de nuevo en {0}
fa: شما قبلا رمز عبور یک‌بار مصرف را درخواست کرده اید. دوباره امتحان کنید در {0}
fr: Vous avez déjà demandé un OTP. Réessayez dans {0}
hi: आपने पहले ही OTP का अनुरोध कर लिया है। {0} में पुनः प्रयास करें
nl: U hebt al een OTP aangevraagd. Probeer het opnieuw over {0}
sv: Du har redan begärt en OTP. Försök igen om {0}

# WaitForElevatedAccessTokenRequestResendDelay
source: You have already requested a elevated access token. Try again in {0}
ar: تحقق من {0}
de: Sie haben bereits einen erhöhten Zugriffstoken angefordert. Versuchen Sie es in {0} erneut
es: Ya has solicitado un token de acceso elevado. Intenta de nuevo en {0}
fa: شما قبلا توکن دسترسی ویژه را درخواست کرده اید. دوباره امتحان کنید در {0}
fr: Vous avez déjà demandé un jeton d'accès élevé. Réessayez dans {0}
hi: आपने पहले ही उन्नत पहुँच टोकन का अनुरोध कर लिया है। {0} में पुनः प्रयास करें
nl: U hebt al een verhoogde toegangs-token aangevraagd. Probeer het opnieuw over {0}
sv: Du har redan begärt en höjd åtkomstkod. Försök igen om {0}

source: OTP
ar: تأكيد {0} بإدخال الكود المرسل إلى {1}
fa: رمز یک‌بار مصرف

# OtpPanelTitle
source: Check your {0}
ar: الكود
de: Überprüfen Sie Ihr {0}
es: Verifica tu {0}
fa: {0} خود را بررسی کنید
fr: Vérifiez votre {0}
hi: अपना {0} चेक करें
nl: Controleer uw {0}
sv: Kontrollera din {0}

# OtpPanelSubtitle
source: Confirm your {0} by entering the code sent to {1}
ar: ألم تتلق الكود؟
de: Bestätigen Sie Ihr {0}, indem Sie den Code eingeben, der an {1} gesendet wurde
es: Confirma tu {0} ingresando el código enviado a {1}
fa: {0} خود را با ورود کد ارسال شده به {1} تایید کنید
fr: Confirmez votre {0} en saisissant le code envoyé à {1}
hi: {1} पर भेजे गए कोड को दर्ज करके अपना {0} पुष्टि करें
nl: Bevestig uw {0} door de code in te voeren die is verzonden naar {1}
sv: Bekräfta din {0} genom att ange koden som skickats till {1}

source: Code
ar: إعادة إرسال
es: Código
fa: کد
hi: कोड
sv: Kod

# OtpResendMessage
source: Didn't get the code?
ar: إرسال OTP
de: Code nicht erhalten?
es: ¿No recibiste el código?
fa: آیا کدی دریافت نکردید?
fr: Pas reçu le code ?
hi: कोड प्राप्त नहीं हुआ?
nl: Geen code ontvangen?
sv: Fick du inte koden?

source: Resend
ar: إرسال رابط سحري و OTP
de: Erneut senden
es: Reenviar
fa: ارسال دوباره
fr: Renvoyer
hi: पुनः भेजें
nl: Opnieuw verzenden
sv: Skicka igen

# SendOtpButtonText
source: Send OTP and Magic link
ar: استخدم كلمة المرور
de: OTP senden
es: Enviar OTP
fa: ارسال رمز یکبار مصرف
fr: Envoyer OTP
hi: OTP भेजें
nl: OTP verzenden
sv: Skicka OTP

source: Either provide password or OTP
ar: {0} هو كودك في Boilerplate.
de: Geben Sie entweder ein Passwort oder eine OTP ein
es: Proporciona contraseña o OTP
fa: رمز عبور اصلی یا یک‌بار مصرف را وارد کنید
fr: Fournir soit un mot de passe, soit un OTP
hi: पासवर्ड या OTP प्रदान करें
nl: Geef óf wachtwoord óf OTP op
sv: Ange antingen lösenord eller OTP

# WaitForTwoFactorTokenRequestResendDelay
source: You have already requested the 2FA token email. Try again in {0}.
ar: {0} هو كودك في Boilerplate.
de: Sie haben die 2FA-Token-E-Mail bereits angefordert. Versuchen Sie es erneut in {0}.
es: Ya has solicitado el correo del token 2FA. Intenta de nuevo en {0}.
fa: شما قبلا درخواست ایمیل توکن 2FA را دارید. دوباره امتحان کنید در {0}
fr: Vous avez déjà demandé l'e-mail du jeton 2FA. Réessayez dans {0}.
hi: आपने पहले ही 2FA टोकन ईमेल का अनुरोध कर लिया है। {0} में पुनः प्रयास करें।
nl: U hebt al een 2FA-token-e-mail aangevraagd. Probeer het opnieuw over {0}.
sv: Du har redan begärt 2FA-token-e-posten. Försök igen om {0}.

# ChangePhoneNumberTokenShortText
source: {0} is your code in Boilerplate.
ar: {0} هو كودك في Boilerplate.
de: {0} ist Ihr Code in Boilerplate.
es: {0} es tu código en Boilerplate.
fa: {0} کد شماست در Boilerplate
fr: {0} est votre code dans Boilerplate.
hi: {0} Boilerplate में आपका कोड है।
nl: {0} is uw code in Boilerplate.
sv: {0} är din kod i Boilerplate.

# ConfirmPhoneTokenShortText
source: {0} is your code in Boilerplate.
ar: {0} هو كودك في Boilerplate.
de: {0} ist Ihr Code in Boilerplate.
es: {0} es tu código en Boilerplate.
fa: {0} کد شماست در Boilerplate
fr: {0} est votre code dans Boilerplate.
hi: {0} Boilerplate में आपका कोड है।
nl: {0} is uw code in Boilerplate.
sv: {0} är din kod i Boilerplate.

# TwoFactorTokenShortText
source: {0} is your code in Boilerplate.
ar: {0} هو كودك في Boilerplate.
de: {0} ist Ihr Code in Boilerplate.
es: {0} es tu código en Boilerplate.
fa: {0} کد شماست در Boilerplate
fr: {0} est votre code dans Boilerplate.
hi: {0} Boilerplate में आपका कोड है।
nl: {0} is uw code in Boilerplate.
sv: {0} är din kod i Boilerplate.

# OtpShortText
source: {0} is your code in Boilerplate.
ar: متصل
de: {0} ist Ihr Code in Boilerplate.
es: {0} es tu código en Boilerplate.
fa: {0} کد شماست در Boilerplate
fr: {0} est votre code dans Boilerplate.
hi: {0} Boilerplate में आपका कोड है।
nl: {0} is uw code in Boilerplate.
sv: {0} är din kod i Boilerplate.

# ResetPasswordTokenShortText
source: {0} is your code in Boilerplate.
ar: مؤخرًا
de: {0} ist Ihr Code in Boilerplate.
es: {0} es tu código en Boilerplate.
fa: {0} کد شماست در Boilerplate
fr: {0} est votre code dans Boilerplate.
hi: {0} Boilerplate में आपका कोड है।
nl: {0} is uw code in Boilerplate.
sv: {0} är din kod i Boilerplate.

source: Online
ar: تحديث
es: En línea
fa: آنلاین
fr: En ligne
hi: ऑनलाइन

source: Recently
ar: حان وقت التحديث
de: Kürzlich
es: Recientemente
fa: اخیرا
fr: Récemment
hi: हाल ही में
nl: Recent
sv: Nyligen

source: Update
ar: هذا التحديث مطلوب للحفاظ على تشغيل التطبيق بسلاسة
de: Aktualisieren
es: Actualizar
fa: بروز رسانی
fr: Mettre à jour
hi: अपडेट
nl: Bijwerken
sv: Uppdatera

# TodoAddPlaceholder
source: Add a todo
ar: ابحث عن مهمة...
de: Todo hinzufügen
es: Agregar una tarea
fa: افزودن یک کار
fr: Ajouter une todo
hi: एक टूडू जोड़ें
nl: Voeg een todo toe
sv: Lägg till en uppgift

# NoTodos
source: No todos yet
ar: تعذر العثور على عنصر المهمة
de: Noch keine Todos
es: No hay tareas aún
fa: هنوز کاری ثبت نشده
fr: Aucune todo pour l'instant
hi: अभी तक कोई टूडू नहीं
nl: Nog geen todos
sv: Inga uppgifter än

# TodoSearchPlaceholder
source: Search todo...
ar: مهمة
de: Todo suchen...
es: Buscar tarea...
fa: جستجوی کارها...
fr: Rechercher une todo...
hi: टूडू खोजें...
nl: Zoek todo...
sv: Sök uppgift...

source: Todo item could not be found
ar: مهمة
de: Todo-Element konnte nicht gefunden werden
es: Elemento de tarea no encontrado
fa: کار پیدا نشد
fr: Élément todo introuvable
hi: टूडू आइटम नहीं मिला
nl: Todo-item kon niet worden gevonden
sv: Uppgiften kunde inte hittas

# TodoPageTitle
source: Todo
ar: حذف عنصر المهمة
es: Tarea
fa: کار
hi: टूडू
sv: Uppgift

source: Todo
ar: تعذر العثور على كيان الفئة
es: Tarea
fa: کار
hi: टूडू
sv: Uppgift

source: Delete todo item
ar: تعذر العثور على كيان المنتج
de: Todo-Element löschen
es: Eliminar elemento de tarea
fa: حذف کار
fr: Supprimer l'élément todo
hi: टूडू आइटम हटाएं
nl: Verwijder todo-item
sv: Ta bort uppgift

# CategoryCouldNotBeFound
source: Category entity could not be found
ar: الفئة
de: Kategorie-Entität konnte nicht gefunden werden
es: Entidad de categoría no encontrada
fa: دسته مورد نظر پیدا نشد
fr: Entité catégorie introuvable
hi: कैटेगरी इकाई नहीं मिली
nl: Categorie-entiteit kon niet worden gevonden
sv: Kategorin kunde inte hittas

# ProductCouldNotBeFound
source: Product entity could not be found
ar: نص بديل
de: Produkt-Entität konnte nicht gefunden werden
es: Entidad de producto no encontrada
fa: محصول پیدا نشد
fr: Entité produit introuvable
hi: प्रोडक्ट इकाई नहीं मिली
nl: Product-entiteit kon niet worden gevonden
sv: Produkten kunde inte hittas

source: Category
ar: لوحة الإدارة
de: Kategorie
es: Categoría
fa: دسته
fr: Catégorie
hi: कैटेगरी
nl: Categorie
sv: Kategori

source: Admin panel
ar: صفحة
es: Panel de administración
fa: پنل ادمین
fr: Panneau d'administration
hi: एडमिन पैनल
nl: Admin-paneel

# PaginatorSummary
source: {0} items
ar: من
de: {0} Elemente
es: {0} elementos
fa: {0} آیتم
fr: {0} éléments
hi: {0} आइटम
sv: {0} objekt

source: Page
ar: عدد المنتجات في آخر 30 يومًا
de: Seite
es: Página
fa: برگه
hi: पेज
nl: Pagina
sv: Sida

source: of
ar: إضافة منتج
de: von
es: de
fa: از
fr: sur
hi: का
nl: van
sv: av

source: Last 30 days product count
ar: ابحث في اسم المنتج والفئة والوصف هنا...
de: Produktanzahl der letzten 30 Tage
es: Conteo de productos de los últimos 30 días
fa: تعداد محصولات ۳۰ روز گذشته
fr: Nombre de produits des 30 derniers jours
hi: पिछले 30 दिनों का उत्पाद गणना
nl: Aantal producten laatste 30 dagen
sv: Produktantal de senaste 30 dagarna

source: Add product
ar: اختر الفئة
de: Produkt hinzufügen
es: Agregar producto
fa: افزودن محصول
fr: Ajouter un produit
hi: उत्पाद जोड़ें
nl: Voeg product toe
sv: Lägg till produkt

source: Select category
ar: إجمالي المنتجات
de: Kategorie auswählen
es: Seleccionar categoría
fa: انتخاب دسته
fr: Sélectionner la catégorie
hi: कैटेगरी चुनें
nl: Selecteer categorie
sv: Välj kategori

source: Total categories
ar: تعديل الفئة
de: Gesamtkategorien
es: Total de categorías
fa: تعداد دسته بندی ها
fr: Total des catégories
hi: कुल कैटेगरी
nl: Totaal categorieën
sv: Antal kategorier

source: Total products
ar: فئة جديدة
de: Gesamtprodukte
es: Total de productos
fa: تعداد محصولات
fr: Total des produits
hi: कुल उत्पाद
nl: Totaal producten
sv: Antal produkter

source: Edit category
ar: الفئات
de: Kategorie bearbeiten
es: Editar categoría
fa: ویرایش دسته
fr: Modifier la catégorie
hi: कैटेगरी संपादित करें
nl: Bewerk categorie
sv: Redigera kategori

# AddCategory
source: New category
ar: أدخل اسم الفئة
de: Neue Kategorie
es: Nueva categoría
fa: دسته جدید
fr: Nouvelle catégorie
hi: नई कैटेगरी
nl: Nieuwe categorie
sv: Ny kategori

# CategoriesPageTitle
source: Categories
ar: أدخل اسم المنتج
de: Kategorien
es: Categorías
fa: دسته بندی ها
fr: Catégories
hi: कैटेगरी
nl: Categorieën
sv: Kategorier

source: Enter category name
ar: الفئات مع عدد المنتجات
de: Kategoriename eingeben
es: Ingresar nombre de categoría
fa: نام دسته را وارد کنید
fr: Saisir le nom de la catégorie
hi: कैटेगरी नाम दर्ज करें
nl: Voer categorienaam in
sv: Ange kategorinamn

source: Enter product name
ar: البحث بالاسم
de: Produktname eingeben
es: Ingresar nombre de producto
fa: نام محصول را وارد کنید
fr: Saisir le nom du produit
hi: उत्पाद नाम दर्ज करें
nl: Voer productnaam in
sv: Ange produktnamn

source: Categories with product count
ar: مخطط عدد المنتجات لكل فئة
de: Kategorien mit Produktanzahl
es: Categorías con conteo de productos
fa: تعداد دسته های دارای محصول
fr: Catégories avec nombre de produits
hi: उत्पाद गणना के साथ कैटेगरी
nl: Categorieën met productenaantal
sv: Kategorier med produktantal

source: Search on name
ar: يظهر هذا المخطط عدد المنتجات في كل فئة.
de: Nach Name suchen
es: Buscar por nombre
fa: جستجو در نام
fr: Rechercher par nom
hi: नाम पर खोजें
nl: Zoek op naam
sv: Sök på namn

source: Products count per category chart
ar: المنتجات
de: Produktanzahl pro Kategorie – Diagramm
es: Gráfico de conteo de productos por categoría
fa: چارت تعداد محصولات در هر دسته
fr: Graphique du nombre de produits par catégorie
hi: कैटेगरी प्रति उत्पाद गणना चार्ट
nl: Grafiek producten per categorie
sv: Diagram över produktantal per kategori

# ProductsCountPerCategoryChartText
source: This chart shows the number of products in each category.
ar: نسبة المنتجات لكل فئة
de: Dieses Diagramm zeigt die Anzahl der Produkte in jeder Kategorie.
es: Este gráfico muestra el número de productos en cada categoría.
fa: این نمودار تعداد محصولات در هر دسته را نشان می دهد.
fr: Ce graphique montre le nombre de produits dans chaque catégorie.
hi: यह चार्ट प्रत्येक कैटेगरी में उत्पादों की संख्या दिखाता है।
nl: Deze grafiek toont het aantal producten in elke categorie.
sv: Detta diagram visar antalet produkter i varje kategori.

# ProductsPageTitle
source: Products
ar: يظهر هذا المخطط نسبة المنتجات في كل فئة.
de: Produkte
es: Productos
fa: محصولات
fr: Produits
hi: उत्पाद
nl: Producten
sv: Produkter

source: Products percentage per category
ar: الفئات
de: Produktanteil pro Kategorie
es: Porcentaje de productos por categoría
fa: درصد محصولات هر دسته
fr: Pourcentage de produits par catégorie
hi: कैटेगरी प्रति उत्पाद प्रतिशत
nl: Percentage producten per categorie
sv: Produktprocent per kategori
