[
  {
    "name": "rad-combo",
    "attributes": [
      {
        "name": "rad-text",
        "description": "You can bind rad text, so combo box will show binded data instead of loading data, until user opens it."
      },
      {
        "name": "rad-datasource",
        "description": "Bind this to kendo data source you've in view model."
      },
      {
        "name": "rad-value-field-name",
        "description": "Property of dto to be assigned into ng-model when user selects."
      },
      {
        "name": "rad-text-field-name",
        "description": "Property of dto to be displayed to user. It can be overrided using item-template. Note that this field will be used for filtering when user searchs in combo box."
      },
      {
        "name": "rad-virtual-entity-loader",
        "description": "Bind this to a method which accepts args : { id : any }. At that function you should return a promise, which resolves into an entity with that id."
      },
      {
        "name": "rad-on-init",
        "description": "Bind this to a method which accepts args : { comboBoxOptions: comboBoxOptions }. You can customize all aspects of your combo box there."
      },
      {
        "name": "k-placeholder",
        "description": "The hint displayed by the widget when it is empty."
      },
      {
        "name": "k-min-length",
        "description": "The minimum number of characters the user must type before a search is performed. Set to higher value than 1 if the search could match a lot of items."
      }
    ]
  },
  {
    "name": "ng-outlet",
    "description": "The directive that identifies where the Router should render its Components."
  },
  {
    "name": "a",
    "attributes": [
      {
        "name": "ng-link",
        "description": "<a ng-link=\"[ 'ViewModelName' , { arg1 : 'value' }]\">Title</a> for binding a clickable HTML element to a route, via a Link Parameters Array."
      }
    ]
  },
  {
    "name": "persian-date-picker",
    "description": "This Date picker work with solar based calendar. It accepts ng-model. To configure date or date/time see is-date-time attribute.",
    "attributes": [
      {
        "name": "is-date-time",
        "values": [ "true", "false" ],
        "type": "boolean",
        "description": "Show/accept date or date time. default: false >> date only."
      }
    ]
  }
]
